{"View license": "Ver licenca", "FILENAME": "Nome do arquivo", "Enter the name of the script file to create.": "Introduza o nome do arquivo para criá-lo.", "The filename must have the .rpy extension.": "O nome do arquivo precisa ter a extensao .rpy.", "The file already exists.": "O arquivo já existe", "# Ren'Py automatically loads all script files ending with .rpy. To use this\n# file, define a label and jump to it from another file.\n": "# Ren'Py carrega automaticamente todos os arquivos que terminam com .rpy. Para usar esse\n# archivo, defina uma label e pule para ele de outro arquivo\n", "To build Android packages, please download RAPT, unzip it, and place it into the Ren'Py directory. Then restart the Ren'Py launcher.": "Para construir um pacote para Android, por favor baixe RAPT, extraia e o coloque dentro da pasta do Ren'Py. Depois reinicie o Ren'Py.", "A 32-bit Java Development Kit is required to build Android packages on Windows. The JDK is different from the JRE, so it's possible you have Java without having the JDK.\n\nPlease {a=http://www.oracle.com/technetwork/java/javase/downloads/index.html}download and install the JDK{/a}, then restart the Ren'Py launcher.": "É necessário o Java Development Kit de 32-bit para construir pacotes para Android no Windows. O JDK é diferente do JRE, é possivel que você possua o Java sem possuir o JDK.\n\nPor favor {a=http://www.oracle.com/technetwork/java/javase/downloads/index.html}baixe e instale o JDK{/a}, depois, reinicie o Ren'Py.", "To build Android packages, please download RAPT (from {a=http://www.renpy.org/dl/android}here{/a}), unzip it, and place it into the Ren'Py directory. Then restart the Ren'Py launcher.": "Para construir pacotes para Android, por favor baixe RAPT (desde {a=http://www.renpy.org/dl/android}aquí{/a}), extraia e o coloque dentro da pasta do Ren'Py. Depois reinicie o Ren'Py.", "RAPT has been installed, but you'll need to install the Android SDK before you can build Android packages. Choose Install SDK to do this.": "RAPT está instalado, mas você precisa instalar o Android SDK para poder construir pacotes para Android. Selecione instalar SDK para instala-lo.", "RAPT has been installed, but a key hasn't been configured. Please create a new key, or restore android.keystore.": "RAPT está instalado, mas a chave não foi configurada. Por favor crie uma nova chave, ou restaure a android.keystore.", "The current project has not been configured. Use \"Configure\" to configure it before building.": "O projeto atual ainda não foi configurado. Use \"Configurar\" para configura-lo antes de construir o pacote.", "Choose \"Build\" to build the current project, or attach an Android device and choose \"Build & Install\" to build and install it on the device.": "Selecione \"Construir\" para construir o projeto atual, ou conecte um dispositivo Android e selecione \"Construir & instalar\" para construí-lo e instala-lo em seu dispositivo.", "Attempts to emulate an Android phone.\n\nTouch input is emulated through the mouse, but only when the button is held down. Escape is mapped to the menu button, and PageUp is mapped to the back button.": "Tentativas para emular um celular Android.\n\nO toque é emulado pelo mouse, mas apenas quando o botao é clicado. Escape  é emulado como botao do menu, e PageUp é emulado como botao de voltar", "Attempts to emulate an Android tablet.\n\nTouch input is emulated through the mouse, but only when the button is held down. Escape is mapped to the menu button, and PageUp is mapped to the back button.": "Tentativas para emular um tablet Android. \n\nO toque é emulado pelo mouse, mas apenas quando o botao é clicado. Escape  é emulado como botao do menu, e PageUp é emulado como botao de voltar", "Attempts to emulate an OUYA console.\n\nController input is mapped to the arrow keys, Enter is mapped to the select button, Escape is mapped to the menu button, and PageUp is mapped to the back button.": "Tentativas para emular um console OUYA. \n\nO toque é emulado pelo mouse, mas apenas quando o botao é clicado. Escape  é emulado como botao do menu, e PageUp é emulado como botao de voltar.", "Downloads and installs the Android SDK and supporting packages. Optionally, generates the keys required to sign the package.": "Baixe e instale o Android SDK e os pacotes de suporte. Opcionalmente, gere as chaves necessarias para autenticar o pacote.", "Configures the package name, version, and other information about this project.": "Configure o nome do pacote, a versao, e outras informações sobre o projeto.", "Opens the file containing the Google Play keys in the editor.\n\nThis is only needed if the application is using an expansion APK. Read the documentation for more details.": "Abre o arquivo que contém as chaves do Google Play no editor. \n\nIsso só é necessario se a aplicação usa expansão APK. Para mais informações, leia a documentação", "Builds the Android package.": "Construir um pacote para android", "Builds the Android package, and installs it on an Android device connected to your computer.": "Construir um pacote para Android, e instala-lo em um dispositivo Android conectado ao seu computador.", "QUESTION": "PERGUNTA", "Emulation:": "Emulação:", "Phone": "Telefone", "Television / OUYA": "Televisao / OUYA", "Build:": "Construir:", "Install SDK & Create Keys": "Instalar SDK & Criar chaves", "Configure": "Configurar", "Build Package": "Construir Pacote", "Build & Install": "Construir & Instalar", "Before packaging Android apps, you'll need to download RAPT, the Ren'Py Android Packaging Tool. Would you like to download RAPT now?": "Antes de construir apps para Android, você precisa baixar RAPT, Ren'Py Android Packaging Tool. Quer baixar o RAPT agora?", "Attempts to emulate a televison-based Android console, like the OUYA or Fire TV.\n\nController input is mapped to the arrow keys, Enter is mapped to the select button, Escape is mapped to the menu button, and PageUp is mapped to the back button.": "Tentativas de emular um console Android television-based, como OUYA ou Fire TV.\n\nPara o controle se usa as setas, Enter está mapeado como o botao select. Escape está mapeado como o botão menu y PageUp está mapeado como o botao back", "Connects to an Android device running ADB in TCP/IP mode.": "Conectar a um dispositivo Android executando ADB em modo TCP/IP.", "Disconnects from an Android device running ADB in TCP/IP mode.": "Desconectar de um dispositivo Android que está usando ADB em modo TCP/IP.", "Other:": "Outros:", "Remote ADB Connect": "Conectar ADB remotamente", "Remote ADB Disconnect": "Desconectar ADB remotamente", "Remote ADB Address": "Endereço remoto ADB", "Please enter the IP address and port number to connect to, in the form \"192.168.1.143:5555\". Consult your device's documentation to determine if it supports remote ADB, and if so, the address and port to use.": "Por favor introduza o endereço IP e o número da porta para se conectar, no formato \"192.168.1.143:5555\". Consulte a documentação de seu dispositivo para averiguar se ele é compativel com ADB remoto, e se sim, o endereço e a porta utilizados.", "Invalid remote ADB address": "Endereço remoto ADB não é válido", "The address must contain one exactly one ':'.": "O endereço deve conter exatamente um ':'.", "The host may not contain whitespace.": "O host não pode conter espaços em branco.", "The port must be a number.": "A porta deve ser um número.", "Builds the Android package, installs it on an Android device connected to your computer, then launches the app on your device.": "Constroi um pacote para Android, instala ele em um dispositivo android conectado ao seu computador, e executa o app em seu dispositivo.", "Television": "Televisao", "Build, Install & Launch": "Construir, instalar & Executar", "Ren'Py was unable to run python with tkinter to choose the directory. Please install the python-tk or tkinter package.": "Ren'Py foi incapaz de rodar python com tkinter para escolher um diretório. Por favor o pacote python-tk ou o pacote tkinter.", "Could not change the theme. Perhaps options.rpy was changed too much.": "Não se conseguiu trocar o tema. Talvez options.rpy tenha sofrido muitas alterações.", "Display": "Tela", "Window": "Janela", "Fullscreen": "Tela cheia", "Planetarium": "Planetário", "Sound Volume": "Volume do som", "Choose Theme": "Escolher Tema", "Theme": "Tema", "Color Scheme": "Combinação de cores", "%b %d, %H:%M": "%d %b, %H:%M", "Quick save complete.": "Quick save completo", "Image [index] of [count] locked.": "Imagem [index] de [count] bloqueada.", "prev": "anterior", "next": "seguinte", "slideshow": "apresentação", "return": "voltar", "Graphics Acceleration": "Aceleração Gráfica", "Automatically Choose": "Escolher automaticamente", "Force Angle/DirectX Renderer": "Forçar Angle/DirectX Renderer", "Force OpenGL Renderer": "Forçar OpenGL Renderer", "Force Software Renderer": "Forçar renderização por software", "Changes will take effect the next time this program is run.": "As mudanças teram efeito na proxima vez que o programa for executado", "Quit": "Sair", "Return": "Voltar", "Performance Warning": "Advertência de rendimento", "This computer is using software rendering.": "Este computador usa renderização por software.", "This computer is not using shaders.": "Este computador não usa shaders.", "This computer is displaying graphics slowly.": "Este computador está mostrando gráficos lentamente.", "This computer has a problem displaying graphics: [problem].": "Este computador possui um problema mostrando gráficos: [problem].", "Its graphics drivers may be out of date or not operating correctly. This can lead to slow or incorrect graphics display. Updating DirectX could fix this problem.": "Seus drivers gráficos podem estar desatualizados ou não funcionar corretamente. Isso pode causar lentidão ou erros nos graficos. Atualizar o DirectX pode solucionar este problema.", "Its graphics drivers may be out of date or not operating correctly. This can lead to slow or incorrect graphics display.": "Seus drivers gráficos podem estar desatualizados ou não funcionar corretamente. Isso pode causar lentidão ou erros nos graficos.", "Update DirectX": "Atualizar DirectX", "Continue, Show this warning again": "Continuar, Mostrar este aviso outra vez", "Continue, Don't show warning again": "Continuar, Não mostrar este aviso outra vez", "Updating DirectX.": "Atualizando DirectX.", "DirectX web setup has been started. It may start minimized in the taskbar. Please follow the prompts to install DirectX.": "DirectX web setup foi iniciado. Ele pode iniciar minimizado na barra de tareas. Por favor siga as instruções para instalar DirectX.", "{b}Note:{/b} Microsoft's DirectX web setup program will, by default, install the Bing toolbar. If you do not want this toolbar, uncheck the appropriate box.": "{b}Nota:{/b} Programa de instalação web do Microsoft DirectX, por padrão, instala a barra de ferramentas do Bing. Se não quer que instale a barra, desative a opção correspondente.", "When setup finishes, please click below to restart this program.": "Quando terminar a instalação, por favor clique abaixo para reiniciar o programa.", "Restart": "Reiniciar", "Saved screenshot as %s.": "Screenshot guardada como %s.", "Are you sure?": "Tem certeza?", "Are you sure you want to delete this save?": "Certeza que deseja deletar este jogo salvo?", "Are you sure you want to overwrite your save?": "Certeza que deseja substituir o jogo salvo?", "Loading will lose unsaved progress.\nAre you sure you want to do this?": "Carregando, perderá o jogo não salvo. \nCerteza que deseja fazer isso?", "Are you sure you want to quit?": "Certeza que deseja sair ?", "Are you sure you want to return to the main menu?\nThis will lose unsaved progress.": "Certeza que deseja voltar para o menu principal?\nPerderá todo jogo não salvo.", "Are you sure you want to begin skipping?": "Certeza que deseja começar a pular os dialogos?", "Are you sure you want to skip to the next choice?": "Certeza que deseja pular para a próxima escolha?", "Are you sure you want to skip to unseen dialogue or the next choice?": "Certeza que deseja pular para o próximo diálogo não visto ou a próxima escolha?", "Skip Mode": "Modo skip", "Fast Skip Mode": "Modo de fast skip", "Updater": "Atualizador", "This program is up to date.": "Este programa está atualizado.", "[u.version] is available. Do you want to install it?": "[u.version] está disponível. Quer instalá-la?", "Preparing to download the updates.": "Preparando para baixar as atualizações.", "Downloading the updates.": "Baixando as atualizações.", "Unpacking the updates.": "Extraindo as atualizações.", "The updates have been installed. The program will restart.": "As atualizações foram instaladas. O programa irá reiniciar.", "The updates have been installed.": "As atualizações foram instaladas.", "The updates were cancelled.": "As atualizaçoes foram canceladas.", "Empty Slot.": "Espaço vazio", "Previous": "Anterior", "Next": "Seguinte", "Joystick Mapping": "Mapear Joystick", "An exception has occurred.": "Uma exceção ocorreu", "Rollback": "Regressar", "Attempts a roll back to a prior time, allowing you to save or choose a different choice.": "Regressa, permitindo você salvar ou selecionar um escolha diferente.", "Ignore": "Ignorar", "Ignores the exception, allowing you to continue. This often leads to additional errors.": "Ignorar a exceção, permitindo continuar. Isso pode ocasionar erros adicionais.", "Reload": "Recarregar", "Reloads the game from disk, saving and restoring game state if possible.": "Recarrega o jogo do disco, salvando e restaurando o estado do jogo, se possível.", "Open Traceback": "Abrir Traceback", "Opens the traceback.txt file in a text editor.": "Abre o arquivo traceback.txt em um editor de texto.", "Quits the game.": "Sair do jogo.", "Parsing the script failed.": "Analisando os scripts falhos.", "Open Parse Errors": "Abrir Análise de erros", "Opens the errors.txt file in a text editor.": "Abre o arquivo errors.txt em um editor de texto.", "Displayable Inspector": "Inspetor exibível", "Nothing to inspect.": "Nada para inspecionar.", "Size": "Tamanho", "Style": "Estilo", "Inspecting Styles of [displayable_name!q]": "Inspecionando estilos de [displayable_name!q]", "displayable:": "exibível:", "        (no properties affect the displayable)": "        (não há propriedades que afetem a visualização)", "        (default properties omitted)": "        (propriedades padrão omitidas)", "<repr() failed>": "<repr() falhou>", "Reload Game (Shift+R)": "Reiniciar Jogo (Shift+R)", "Variable Viewer": "Visualizador de Variáveis", "Theme Test": "Testar Tema", "Image Location Picker": "Image Location PIcker", "Filename List": "Lista de Arquivos", "Undefined Images": "Imagens não definidas", "Mouse position: %r": "Posição do mouse: %r", "Right-click or escape to quit.": "Click com o botão direito do mouse ou escape para sair.", "Done": "Feito", "Developer Menu": "Menu do Desenvolvedor", "Rectangle: %r": "Retângulo: %r", "Console (Shift+O)": "Console (Shift.+O)", "Show Image Load Log": "Mostrar registros do carregamento de imagens", "Hide Image Load Log": "Esconder registros do carregamento de imagens", "No variables have changed since the game started.": "Nenhuma variavel mudou desde o ínicio do jogo.", "Return to the developer menu": "Voltar ao menu de desenvolvedor", "%(version)s console, originally by Shiz, C, and delta.\n": "Console %(version)s, original por Shiz, C, e delta.\n", "Press <esc> to exit console. Type help for help.\n": "Pressione <esc> para sair do console. Escreva 'help' para ajuda.\n", "Ren'Py script enabled.": "Script Ren'Py habilitado.", "Ren'Py script disabled.": "Script Ren'Py desabilitado.", "help: show this help": "help: mostra essa ajuda", "commands:\n": "comandos:\n", " <renpy script statement>: run the statement\n": " <declarção renpy script>: executa a declaração\n", " <python expression or statement>: run the expression or statement": " <expressão ou declaração python>: executa a expressão ou a declaração", "clear: clear the console history": "clear: limpa o histórico do console", "exit: exit the console": "exit: sair do console", "load <slot>: loads the game from slot": "load <slot>: carrega o jogo do 'slot'", "save <slot>: saves the game in slot": "save <slot>: salva o jogo no 'slot'", "reload: reloads the game, refreshing the scripts": "reload: recarrega o jogo, atualizando os scripts", "watch <expression>: watch a python expression": "watch <expresión>: observa uma expressão python", "unwatch <expression>: stop watching an expression": "unwatch <expresión>: para de observar uma expressão", "unwatchall: stop watching all expressions": "unwatchall: deixa de observar todas as expressões", "jump <label>: jumps to label": "jump <label>: pula para a label", "{b}Missing Images{/b}": "{b}Imagens ausentes{/b}", "Autoreload": "Autocarregamento", "Location": "Local", "Self-voicing enabled. Press 'v' to disable.": "Self-voicing ativado. Pressione 'v' para desativa-lo.", "Clipboard voicing enabled. Press 'shift+C' to disable.": "'Clipboard por voz' ativado. Aperte 'Shift+C' para desativa-lo.", "The Ren'Py Updater is not supported on mobile devices.": "O atualizador do Ren'Py não é compatível com dispositivos móveis.", "An error is being simulated.": "Um erro foi simulado.", "Either this project does not support updating, or the update status file was deleted.": "Ou o projeto não suporta atualizações, ou o arquivo de update status foi deletado.", "This account does not have permission to perform an update.": "Essa conta não possui permissão para realizar uma atualização.", "This account does not have permission to write the update log.": "Essa conta não possui permissão para escrever no registro de atualizações.", "Could not verify update signature.": "Não se pode verificar a assinatura da atualização.", "The update file was not downloaded.": "O arquivo da atualização não foi baixado.", "The update file does not have the correct digest - it may have been corrupted.": "O arquivo da atualizaçao não possui o 'digest' correto - é possível que esteja danificado.", "While unpacking {}, unknown type {}.": "Tipo desconhecido {1} ao extrair {0}.", "Rectangle copied to clipboard.": "Retângulo copiado para o clipboard.", "Position copied to clipboard.": "Posição copiada para o clipboard.", "Self-voicing disabled.": "Auto-voz desativada.", "Clipboard voicing enabled. ": "Voz da área de transferência ativada. ", "Self-voicing enabled. ": "Auto-voz ativada. ", "selected": "selecionado", "viewport": "janela de visualização", "horizontal scroll": "rolagem horizontal", "vertical scroll": "rolagem vertical", "activate": "ativar", "deactivate": "desativar", "increase": "aumentar", "decrease": "diminuir", "Font Override": "Substituição de fonte", "Default": "Padrão", "Text Size Scaling": "Dimensionamento do tamanho do texto", "Reset": "Redefinir", "Line Spacing Scaling": "Escala de espaçamento de linha", "High Contrast Text": "Texto com alto contraste", "Enable": "Ativar", "Disable": "Desativar", "Self-Voicing": "Autoexpressão", "Off": "Desligado", "Text-to-speech": "Conversão de texto em fala", "Clipboard": "Área de transferência", "Debug": "Depurar", "Self-Voicing Volume Drop": "Queda de volume por auto-envio de voz", "The options on this menu are intended to improve accessibility. They may not work with all games, and some combinations of options may render the game unplayable. This is not an issue with the game or engine. For the best results when changing fonts, try to keep the text size the same as it originally was.": "As opções deste menu têm o objetivo de melhorar a acessibilidade. Elas podem não funcionar com todos os jogos, e algumas combinações de opções podem tornar o jogo impossível de ser jogado. Isso não é um problema com o jogo ou com o mecanismo. Para obter os melhores resultados ao alterar as fontes, tente manter o tamanho do texto igual ao original.", "{#weekday}Monday": "{#weekday}Segunda-feira", "{#weekday}Tuesday": "{#weekday}Terça-feira", "{#weekday}Wednesday": "{#weekday}Quarta-feira", "{#weekday}Thursday": "{#weekday}Quinta-feira", "{#weekday}Friday": "{#weekday}Sexta-feira", "{#weekday}Saturday": "{#weekday}Sábado", "{#weekday}Sunday": "{#weekday}Domingo", "{#weekday_short}Mon": "{#weekday_short}Mês", "{#weekday_short}Tue": "{#weekday_short}Terça-feira", "{#weekday_short}Wed": "{#weekday_short}Quarta", "{#weekday_short}Thu": "{#weekday_short}Assim", "{#weekday_short}Fri": "{#weekday_short}Sex", "{#weekday_short}Sat": "{#weekday_short}Sábado", "{#weekday_short}Sun": "{#weekday_short}Sol", "{#month}January": "{#month}Janeiro", "{#month}February": "{#month}Fevereiro", "{#month}March": "{#month}Março", "{#month}April": "{#month}Abril", "{#month}May": "{#month}Maio", "{#month}June": "{#month}Junho", "{#month}July": "{#month}Julho", "{#month}August": "{#month}Agosto", "{#month}September": "{#month}Setembro", "{#month}October": "{#month}Outubro", "{#month}November": "{#month}Novembro", "{#month}December": "{#month}Dezembro", "{#month_short}Feb": "{#month_short}fevereiro", "{#month_short}Apr": "{#month_short}Abril", "{#month_short}May": "{#month_short}Maio", "{#month_short}Jun": "{#month_short}Junho", "{#month_short}Jul": "{#month_short}Julho", "{#month_short}Aug": "{#month_short}Ago", "{#month_short}Sep": "{#month_short}Setembro", "{#month_short}Oct": "{#month_short}Outubro", "{#month_short}Dec": "{#month_short}Dez", "Save slot %s: [text]": "Salvar slot %s: [text]", "Load slot %s: [text]": "Carregar slot %s: [text]", "Delete slot [text]": "Excluir slot [text]", "File page auto": "Página de arquivo automática", "File page quick": "Página de arquivo rápida", "File page [text]": "Página de arquivo [text]", "Next file page.": "Próxima página de arquivo.", "Previous file page.": "Página anterior do arquivo.", "Quick save.": "Salvamento rápido.", "Quick load.": "Carregamento rápido.", "Language [text]": "Idioma [text]", "The interactive director is not enabled here.": "O diretor interativo não está habilitado aqui.", "(statement)": "(declaração)", "(attributes)": "(atributos)", "(channel)": "(canal)", "(filename)": "(nome do arquivo)", "Change": "Mudança", "Add": "Adicionar", "Remove": "Remover", "Statement:": "Declaração:", "Tag:": "Etiqueta:", "Attributes:": "Atributos:", "Click to toggle attribute, right click to toggle negative attribute.": "Clique para alternar o atributo, clique com o botão direito para alternar o atributo negativo.", "Transforms:": "Transformações:", "Click to set transform, right click to add to transform list.": "Clique para definir a transformação, clique com o botão direito do mouse para adicionar à lista de transformação.", "Behind:": "Atrás:", "Click to set, right click to add to behind list.": "Clique para definir, clique com o botão direito do mouse para adicionar à lista de pendências.", "Transition:": "Transição:", "Channel:": "Canal:", "Audio Filename:": "Nome do arquivo de áudio:", "Are you sure you want to end the replay?": "Tem certeza de que deseja encerrar o replay?", "Are you sure you want to skip unseen dialogue to the next choice?": "Tem certeza de que deseja pular o diálogo não visto para a próxima opção?", "This save was created on a different device. Maliciously constructed save files can harm your computer. Do you trust this save's creator and everyone who could have changed the file?": "Esse arquivo salvo foi criado em um dispositivo diferente. Arquivos salvos criados de forma maliciosa podem danificar seu computador. Você confia no criador desse arquivo salvo e em todas as pessoas que poderiam ter alterado o arquivo?", "Do you trust the device the save was created on? You should only choose yes if you are the device's sole user.": "Você confia no dispositivo em que o salvamento foi criado? Você só deve escolher sim se for o único usuário do dispositivo.", "Failed to save screenshot as %s.": "Falha ao salvar a captura de tela como %s.", "This program contains free software under a number of licenses, including the MIT License and GNU Lesser General Public License. A complete list of software, including links to full source code, can be found {a=https://www.renpy.org/l/license}here{/a}.": "Este programa contém software livre sob várias licenças, incluindo a Licença MIT e a Licença Pública Geral Menor GNU. Uma lista completa de softwares, incluindo links para o código-fonte completo, pode ser encontrada em {a=https://www.renpy.org/l/license}aqui{/a}.", "display": "exibição", "transitions": "transições", "skip transitions": "pular transições", "video sprites": "sprites de vídeo", "show empty window": "mostrar janela vazia", "text speed": "velocidade do texto", "skip": "pular", "skip unseen [text]": "pular sem ser visto [text]", "skip unseen text": "pular texto não visto", "begin skipping": "começar a pular", "after choices": "após as escolhas", "skip after choices": "pular após as escolhas", "auto-forward time": "tempo de encaminhamento automático", "auto-forward": "encaminhamento automático", "Auto forward": "Avanço automático", "auto-forward after click": "encaminhamento automático após o clique", "automatic move": "movimento automático", "wait for voice": "aguardar a voz", "voice sustain": "sustentação de voz", "self voicing": "autoexpressão", "self voicing volume drop": "queda de volume de voz automática", "clipboard voicing": "Voz da prancheta", "debug voicing": "depurar voz", "emphasize audio": "enfatizar o áudio", "rollback side": "lado da reversão", "gl framerate": "taxa de quadros do gl", "font transform": "transformação de fonte", "font size": "tamanho da fonte", "font line spacing": "espaçamento entre linhas da fonte", "system cursor": "cursor do sistema", "renderer menu": "menu do renderizador", "accessibility menu": "menu de acessibilidade", "high contrast text": "texto com alto contraste", "audio when minimized": "áudio quando minimizado", "audio when unfocused": "áudio quando fora de foco", "web cache preload": "pré-carregamento do cache da web", "voice after game menu": "voz após o menu do jogo", "main volume": "volume principal", "music volume": "volume da música", "sound volume": "volume do som", "voice volume": "volume de voz", "mute main": "silenciar principal", "mute music": "música sem som", "mute sound": "silenciar o som", "mute voice": "voz muda", "mute all": "silenciar tudo", "Self-voicing would say \"[renpy.display.tts.last]\". Press 'alt+shift+V' to disable.": "A voz autônoma diria \"[renpy.display.tts.last]\". Pressione \"alt+shift+V\" para desativar.", "Speech Bubble Editor": "Editor de balão de fala", "(hide)": "(ocultar)", "Sync downloaded.": "Sincronização baixada.", "Could not connect to the Ren'Py Sync server.": "Não foi possível conectar-se ao servidor Ren'Py Sync.", "The Ren'Py Sync server timed out.": "O servidor Ren'Py Sync atingiu o tempo limite.", "An unknown error occurred while connecting to the Ren'Py Sync server.": "Ocorreu um erro desconhecido durante a conexão com o servidor Ren'Py Sync.", "The Ren'Py Sync server does not have a copy of this sync. The sync ID may be invalid, or it may have timed out.": "O servidor Ren'Py Sync não tem uma cópia dessa sincronização. O ID da sincronização pode ser inválido ou pode ter atingido o tempo limite.", "Please enter the sync ID you generated.\nNever enter a sync ID you didn't create yourself.": "Digite a ID de sincronização que você gerou.\nNunca insira uma ID de sincronização que não tenha sido criada por você.", "The sync ID is not in the correct format.": "A ID de sincronização não está no formato correto.", "The sync could not be decrypted.": "A sincronização não pôde ser descriptografada.", "The sync belongs to a different game.": "A sincronização pertence a um jogo diferente.", "The sync contains a file with an invalid name.": "A sincronização contém um arquivo com um nome inválido.", "This will upload your saves to the {a=https://sync.renpy.org}Ren'Py Sync Server{/a}.\nDo you want to continue?": "Isso fará o upload de seus salvamentos para o {a=https://sync.renpy.org}Ren'Py Sync Server{/a}.\nVocê quer continuar?", "Enter Sync ID": "Inserir ID de sincronização", "This will contact the {a=https://sync.renpy.org}Ren'Py Sync Server{/a}.": "Isso entrará em contato com o {a=https://sync.renpy.org}Ren'Py Sync Server{/a}.", "Sync Success": "Sucesso na sincronização", "The Sync ID is:": "A ID de sincronização é:", "You can use this ID to download your save on another device.\nThis sync will expire in an hour.\nRen'Py Sync is supported by {a=https://www.renpy.org/sponsors.html}Ren'Py's Sponsors{/a}.": "Você pode usar essa ID para fazer o download do seu salvamento em outro dispositivo.\nEssa sincronização expirará em uma hora.\nO Ren'Py Sync é apoiado por {a=https://www.renpy.org/sponsors.html}Patrocinadores do Ren'Py{/a}.", "Sync Error": "Erro de sincronização", "Contacting App Store\nPlease Wait...": "Como entrar em contato com a App Store\nAguarde...", "Interactive Director (D)": "Diretor interativo (D)", "Persistent Viewer": "Visualizador persistente", "Show Image Load Log (F4)": "Mostrar registro de carregamento de imagem (F4)", "Hide Image Load Log (F4)": "Ocultar registro de carregamento de imagem (F4)", "Image Attributes": "Atributos de imagem", "Speech Bubble Editor (Shift+B)": "Editor de balões de fala (Shift+B)", "[name] [attributes] (hidden)": "[name] [attributes] (oculto)", "Hide deleted": "Ocultar excluído", "Show deleted": "Mostrar excluído", "Type to filter: ": "Tipo para filtrar: ", "Textures: [tex_count] ([tex_size_mb:.1f] MB)": "Texturas: [tex_count] ([tex_size_mb:.1f] MB)", "Image cache: [cache_pct:.1f]% ([cache_size_mb:.1f] MB)": "Cache de imagem: [cache_pct:.1f]% ([cache_size_mb:.1f] MB)", "\n{color=#cfc}✔ predicted image (good){/color}\n{color=#fcc}✘ unpredicted image (bad){/color}\n{color=#fff}Drag to move.{/color}": "\n{color=#cfc}Imagem prevista (boa){/color}\n{color=#fcc}Imagem não prevista (ruim){/color}\n{color=#fff}Arraste para mover.{/color}", "help: show this help\n help <expr>: show signature and documentation of <expr>": "help: mostrar essa ajuda\n help <expr>: Mostrar assinatura e documentação de <expr>", "Help may display undocumented functions. Please check that the function or\nclass you want to use is documented.\n\n": "A ajuda pode exibir funções não documentadas. Verifique se a função ou\nque você deseja usar está documentada.\n\n", "stack: print the return stack": "stack: imprimir a pilha de retorno", "watch <expression>: watch a python expression\n watch short: makes the representation of traced expressions short (default)\n watch long: makes the representation of traced expressions as is": "watch <expression>: assistir a uma expressão em python\n watch short: torna a representação das expressões rastreadas curta (padrão)\n watch long: faz a representação de expressões rastreadas como é", "short: Shorten the representation of objects on the console (default).": "short: Reduzir a representação de objetos no console (padrão).", "long: Print the full representation of objects on the console.": "long: Imprima a representação completa dos objetos no console.", "escape: Enables escaping of unicode symbols in unicode strings.": "escape: Permite o escape de símbolos unicode em cadeias de caracteres unicode.", "unescape: Disables escaping of unicode symbols in unicode strings and print it as is (default).": "unescape: Desativa o escape de símbolos unicode em cadeias de caracteres unicode e os imprime como estão (padrão).", "No packages are selected, so there's nothing to do.": "Nenhum pacote foi selecionado. Não a nada para fazer.", "Scanning project files...": "Escaneando os arquivos do projeto...", "Scanning Ren'Py files...": "Escaneando os arquivos do Ren'Py...", "All packages have been built.\n\nDue to the presence of permission information, unpacking and repacking the Linux and Macintosh distributions on Windows is not supported.": "Todos os pacotes foram construidos.\n\nDevido a presença de informações sobre permissões, empacotar e desempacotar as distribuições para Linux e Macintosh não é suportado no Windows.", "Archiving files...": "Arquivando...", "Writing the [variant] [format] package.": "Escrevendo o pacote [format] para [variant].", "Making the [variant] update zsync file.": "Criando o arquivo de atualização zsync para [variant].", "Processed {b}[complete]{/b} of {b}[total]{/b} files.": "Processado {b}[complete]{/b} de {b}[total]{/b} arquivos.", "Building distributions failed:\n\nThe build.directory_name variable may not include the space, colon, or semicolon characters.": "Contrução das distribuições falhou:\n\nA variável build.directory_name não pode ter espaços, vírgulas ou ponto e vírgula.", "Build Distributions: [project.current.name!q]": "Construir Distribuições: [project.current.name!q]", "Directory Name:": "Nome do diretório:", "Executable Name:": "Nome do executável:", "Actions:": "Ações:", "Edit options.rpy": "Editar options.rpy", "Refresh": "Recarregar", "Build Packages:": "Construir Pacotes:", "Build Updates": "Construir Atualizações", "Build": "Construir", "Errors were detected when running the project. Please ensure the project runs without errors before building distributions.": "Erros foram encontrados ao executar o projeto. Por favor garanta que o projeto rode sem erros antes de construir distribuições.", "Your project does not contain build information. Would you like to add build information to the end of options.rpy?": "Seu projeto não contêm informações para contrução. Gostaria de adicionar as informações de construção no final do options.rpy?", "Add from clauses to calls, once": "Adicionar das cláusulas para as chamadas, uma vez", "Options:": "Opções:", "Add from clauses to calls": "Adicionar das cláusulas para as chamadas", "Adding from clauses to call statements that do not have them.": "Adicionando das cláusulas para chamar declarações que não as têm.", "{b}Recommended.{/b} A beta editor with an easy to use interface and features that aid in development, such as spell-checking. Editra currently lacks the IME support required for Chinese, Japanese, and Korean text input.": "{b}Recomendado.{/b} Um editor beta com uma interface fácil  para uso e características que ajudam no desenvolvimento, como correção ortográfica. Editra atualmente carece do suporte IME necessário para textos em Chinês, Japonês e Coreano.", "{b}Recommended.{/b} A beta editor with an easy to use interface and features that aid in development, such as spell-checking. Editra currently lacks the IME support required for Chinese, Japanese, and Korean text input. On Linux, Editra requires wxPython.": "{b}Recomendado.{/b} Um editor beta com uma interface fácil  para uso e características que ajudam no desenvolvimento, como correção ortográfica. Editra atualmente carece do suporte IME necessário para textos em Chinês, Japonês e Coreano. No Linux, Editra necessita do wxPython.", "This may have occured because wxPython is not installed on this system.": "Isto pode ter ocorrido porque wxPython não está instalado neste sistema.", "Up to 22 MB download required.": "Downlod de 22 MB é necessário.", "A mature editor that requires Java.": "Um editor muito maduro que precisa de Java.", "1.8 MB download required.": "Downlod de 1.8 MB é necessário.", "This may have occured because Java is not installed on this system.": "Isto pode ter ocorrido porque Java não está instalado neste sistema", "System Editor": "Editor do sistema", "Invokes the editor your operating system has associated with .rpy files.": "Usa o editor do seu sistema operacional para que seja associado aos arquivos .rpy.", "None": "Nenhum", "Prevents Ren'Py from opening a text editor.": "Evita que Ren'Py abra um editor de texto.", "An exception occured while launching the text editor:\n[exception!q]": "Ocorreu uma exceção ao executar o editor de texto:\\[exception!q]", "Select Editor": "Selecionar Editor", "A text editor is the program you'll use to edit Ren'Py script files. Here, you can select the editor Ren'Py will use. If not already present, the editor will be automatically downloaded and installed.": "Um editor de texto é um programa que você vai utilizar para editar os scripts do Ren'Py. Aquí, pode selecionar o editor que Ren'Py usará. Se não estiver disponivel, O editor baixará e instalara automaticamente.", "Renderer": "Renderizador", "Force GL Renderer": "Forçar o renderizador GL", "Force ANGLE Renderer": "Renderizador Force ANGLE", "Force GLES Renderer": "Forçar o renderizador GLES", "Force GL2 Renderer": "Renderizador Force GL2", "Force ANGLE2 Renderer": "Renderizador Force ANGLE2", "Force GLES2 Renderer": "Forçar o renderizador GLES2", "Enable (No Blocklist)": "Ativar (sem lista de bloqueio)", "Framerate": "Taxa de quadros", "Screen": "Tela", "This game requires use of GL2 that can't be initialised.": "Esse jogo requer o uso de GL2 que não pode ser inicializado.", "The {a=edit:1:log.txt}log.txt{/a} file may contain information to help you determine what is wrong with your computer.": "O arquivo {a=edit:1:log.txt}log.txt{/a} pode conter informações que o ajudarão a determinar o que há de errado com o computador.", "More details on how to fix this can be found in the {a=[url]}documentation{/a}.": "Mais detalhes sobre como corrigir esse problema podem ser encontrados na documentação do site {a=[url]}{/a} .", "Change render options": "Alterar opções de renderização", "Select Gamepad to Calibrate": "Selecione Gamepad para calibrar", "No Gamepads Available": "Não há gamepads disponíveis", "Calibrating [name] ([i]/[total])": "Calibrando [name] ([i]/[total])", "Press or move the '[control!s]' [kind].": "Pressione ou mova o ícone '[control!s]' [kind].", "Skip (A)": "Pular (A)", "Back (B)": "Parte traseira (B)", "Open": "Aberto", "Copy BBCode": "Copiar BBCode", "Copies the traceback.txt file to the clipboard as BBcode for forums like https://lemmasoft.renai.us/.": "Copia o arquivo traceback.txt para a área de transferência como BBcode para fóruns como https://lemmasoft.renai.us/.", "Copy Markdown": "Copiar Markdown", "Copies the traceback.txt file to the clipboard as Markdown for Discord.": "Copia o arquivo traceback.txt para a área de transferência como Markdown para Discord.", "Ignores the exception, allowing you to continue.": "Ignora a exceção, permitindo que você continue.", "Opens a console to allow debugging the problem.": "Abre um console para permitir a depuração do problema.", "PROJECTS:": "PROJETOS:", "refresh": "Atualizar", "+ Create New Project": "+ Criar um novo projeto", "Launch Project": "Executar Projeto", "[p.name!q] (template)": "[p.name!q] (modelo)", "The Question": "A pergunta", "Active Project": "Projeto Ativo", "Open Directory": "Abrir Diretório", "Edit File": "Editar Arquivo", "All script files": "Todos os scripts", "Navigate Script": "Navegar pelos os Scripts", "Check Script (Lint)": "Checar Script (Lint)", "Change Theme": "Mudar Tema", "Delete Persistent": "Eliminar Dados Persistentes", "Build Distributions": "Construir Distribuições", "Generate Translations": "Gerar Traduções", "Extract Dialogue": "Extrair Diálogos", "Checking script for potential problems...": "Checando script por potenciais problemas...", "Deleting persistent data...": "Eliminando datos persistentes...", "Open [text] directory.": "Abrir diretório [text].", "Select project [text].": "Selecionar projeto [text].", "Force Recompile": "Forçar Recompilação", "Recompiling all rpy files into rpyc files...": "Recompilando todos os arquivos rpy em arquivos rpyc...", "## Initialization": "## Inicialização", "## The init offset statement causes the initialization statements in this file to run before init statements in any other file.": "## A instrução init offset faz com que as instruções de inicialização nesse arquivo sejam executadas antes das instruções init em qualquer outro arquivo.", "## Calling gui.init resets the styles to sensible default values, and sets the width and height of the game.": "## Chamar gui.init redefine os estilos para os valores padrão sensatos e define a largura e a altura do jogo.", "## Enable checks for invalid or unstable properties in screens or transforms": "## Habilitar verificações de propriedades inválidas ou instáveis em telas ou transformações", "## GUI Configuration Variables": "## Variáveis de configuração da GUI", "## Colors": "## Cores", "## The colors of text in the interface.": "## As cores do texto na interface.", "## An accent color used throughout the interface to label and highlight text.": "## Uma cor de destaque usada em toda a interface para rotular e destacar o texto.", "## The color used for a text button when it is neither selected nor hovered.": "## A cor usada para um botão de texto quando ele não está selecionado nem passa o mouse.", "## The small color is used for small text, which needs to be brighter/darker to achieve the same effect.": "## A cor pequena é usada para texto pequeno, que precisa ser mais claro/escuro para obter o mesmo efeito.", "## The color that is used for buttons and bars that are hovered.": "## A cor que é usada para botões e barras que passam pelo mouse.", "## The color used for a text button when it is selected but not focused. A button is selected if it is the current screen or preference value.": "## A cor usada em um botão de texto quando ele está selecionado, mas não focalizado. Um botão estará selecionado se for a tela atual ou o valor de preferência.", "## The color used for a text button when it cannot be selected.": "## A cor usada para um botão de texto quando ele não pode ser selecionado.", "## Colors used for the portions of bars that are not filled in. These are not used directly, but are used when re-generating bar image files.": "## Cores usadas para as partes das barras que não estão preenchidas. Elas não são usadas diretamente, mas são usadas ao gerar novamente os arquivos de imagem de barra.", "## The colors used for dialogue and menu choice text.": "## As cores usadas para o diálogo e o texto da opção de menu.", "## Fonts and Font Sizes": "## Fontes e tamanhos de fonte", "## The font used for in-game text.": "## A fonte usada para o texto do jogo.", "## The font used for character names.": "## A fonte usada para os nomes dos caracteres.", "## The font used for out-of-game text.": "## A fonte usada para o texto fora do jogo.", "## The size of normal dialogue text.": "## O tamanho do texto normal do diálogo.", "## The size of character names.": "## O tamanho dos nomes dos caracteres.", "## The size of text in the game's user interface.": "## O tamanho do texto na interface de usuário do jogo.", "## The size of labels in the game's user interface.": "## O tamanho dos rótulos na interface de usuário do jogo.", "## The size of text on the notify screen.": "## O tamanho do texto na tela de notificação.", "## The size of the game's title.": "## O tamanho do título do jogo.", "## Main and Game Menus": "## Menus principal e de jogos", "## The images used for the main and game menus.": "## As imagens usadas nos menus principal e de jogo.", "## Dialogue": "## Diálogo", "## These variables control how dialogue is displayed on the screen one line at a time.": "## Essas variáveis controlam como o diálogo é exibido na tela, uma linha por vez.", "## The height of the textbox containing dialogue.": "## A altura da caixa de texto que contém o diálogo.", "## The placement of the textbox vertically on the screen. 0.0 is the top, 0.5 is center, and 1.0 is the bottom.": "## O posicionamento da caixa de texto verticalmente na tela. 0,0 é a parte superior, 0,5 é o centro e 1,0 é a parte inferior.", "## The placement of the speaking character's name, relative to the textbox. These can be a whole number of pixels from the left or top, or 0.5 to center.": "## O posicionamento do nome do personagem que fala, em relação à caixa de texto. Pode ser um número inteiro de pixels a partir da esquerda ou do topo, ou 0,5 para o centro.", "## The horizontal alignment of the character's name. This can be 0.0 for left-aligned, 0.5 for centered, and 1.0 for right-aligned.": "## O alinhamento horizontal do nome do personagem. Pode ser 0,0 para alinhado à esquerda, 0,5 para centralizado e 1,0 para alinhado à direita.", "## The width, height, and borders of the box containing the character's name, or None to automatically size it.": "## A largura, a altura e as bordas da caixa que contém o nome do caractere ou Nenhum para dimensioná-la automaticamente.", "## The borders of the box containing the character's name, in left, top, right, bottom order.": "## As bordas da caixa que contém o nome do personagem, na ordem esquerda, superior, direita e inferior.", "## If True, the background of the namebox will be tiled, if False, the background of the namebox will be scaled.": "## Se for True, o plano de fundo da caixa de nome será lado a lado; se for False, o plano de fundo da caixa de nome será dimensionado.", "## The placement of dialogue relative to the textbox. These can be a whole number of pixels relative to the left or top side of the textbox, or 0.5 to center.": "## O posicionamento do diálogo em relação à caixa de texto. Esse pode ser um número inteiro de pixels em relação ao lado esquerdo ou superior da caixa de texto, ou 0,5 em relação ao centro.", "## The maximum width of dialogue text, in pixels.": "## A largura máxima do texto da caixa de diálogo, em pixels.", "## The horizontal alignment of the dialogue text. This can be 0.0 for left-aligned, 0.5 for centered, and 1.0 for right-aligned.": "## O alinhamento horizontal do texto da caixa de diálogo. Pode ser 0,0 para alinhado à esquerda, 0,5 para centralizado e 1,0 para alinhado à direita.", "## Buttons": "## Botões", "## These variables, along with the image files in gui/button, control aspects of how buttons are displayed.": "## Essas variáveis, juntamente com os arquivos de imagem em gui/button, controlam aspectos de como os botões são exibidos.", "## The width and height of a button, in pixels. If None, Ren'Py computes a size.": "## A largura e a altura de um botão, em pixels. Se nenhum, Ren'Py calcula um tamanho.", "## The borders on each side of the button, in left, top, right, bottom order.": "## As bordas em cada lado do botão, na ordem esquerda, superior, direita e inferior.", "## If True, the background image will be tiled. If False, the background image will be linearly scaled.": "## Se for True, a imagem de fundo será lado a lado. Se for False, a imagem de fundo será dimensionada linearmente.", "## The font used by the button.": "## A fonte usada pelo botão.", "## The size of the text used by the button.": "## O tamanho do texto usado pelo botão.", "## The color of button text in various states.": "## A cor do texto do botão em vários estados.", "## The horizontal alignment of the button text. (0.0 is left, 0.5 is center, 1.0 is right).": "## O alinhamento horizontal do texto do botão. (0,0 é à esquerda, 0,5 é ao centro, 1,0 é à direita).", "## These variables override settings for different kinds of buttons. Please see the gui documentation for the kinds of buttons available, and what each is used for.": "## Essas variáveis substituem as configurações de diferentes tipos de botões. Consulte a documentação do gui para saber os tipos de botões disponíveis e para que cada um é usado.", "## These customizations are used by the default interface:": "## Essas personalizações são usadas pela interface padrão:", "## You can also add your own customizations, by adding properly-named variables. For example, you can uncomment the following line to set the width of a navigation button.": "## Você também pode adicionar suas próprias personalizações, acrescentando variáveis com nomes adequados. Por exemplo, você pode descomentar a seguinte linha para definir a largura de um botão de navegação.", "## Choice Buttons": "## Botões de escolha", "## Choice buttons are used in the in-game menus.": "## Os botões de escolha são usados nos menus do jogo.", "## File Slot Buttons": "## Botões de slot de arquivo", "## A file slot button is a special kind of button. It contains a thumbnail image, and text describing the contents of the save slot. A save slot uses image files in gui/button, like the other kinds of buttons.": "## Um botão de slot de arquivo é um tipo especial de botão. Ele contém uma imagem em miniatura e um texto que descreve o conteúdo do slot de salvamento. Um slot para salvar usa arquivos de imagem em gui/button, como os outros tipos de botões.", "## The save slot button.": "## O botão salvar slot.", "## The width and height of thumbnails used by the save slots.": "## A largura e a altura das miniaturas usadas pelos slots de salvamento.", "## The number of columns and rows in the grid of save slots.": "## O número de colunas e linhas na grade de slots de salvamento.", "## Positioning and Spacing": "## Posicionamento e espaçamento", "## These variables control the positioning and spacing of various user interface elements.": "## Essas variáveis controlam o posicionamento e o espaçamento de vários elementos da interface do usuário.", "## The position of the left side of the navigation buttons, relative to the left side of the screen.": "## A posição do lado esquerdo dos botões de navegação, em relação ao lado esquerdo da tela.", "## The vertical position of the skip indicator.": "## A posição vertical do indicador de salto.", "## The vertical position of the notify screen.": "## A posição vertical da tela de notificação.", "## The spacing between menu choices.": "## O espaçamento entre as opções de menu.", "## Buttons in the navigation section of the main and game menus.": "## Botões na seção de navegação dos menus principal e de jogo.", "## Controls the amount of spacing between preferences.": "## Controla a quantidade de espaçamento entre as preferências.", "## Controls the amount of spacing between preference buttons.": "## Controla a quantidade de espaçamento entre os botões de preferência.", "## The spacing between file page buttons.": "## O espaçamento entre os botões de página de arquivo.", "## The spacing between file slots.": "## O espaçamento entre os slots de arquivo.", "## The position of the main menu text.": "## A posição do texto do menu principal.", "## Frames": "## Quadros", "## These variables control the look of frames that can contain user interface components when an overlay or window is not present.": "## Essas variáveis controlam a aparência dos quadros que podem conter componentes da interface do usuário quando uma sobreposição ou janela não está presente.", "## Generic frames.": "## Quadros genéricos.", "## The frame that is used as part of the confirm screen.": "## O quadro que é usado como parte da tela de confirmação.", "## The frame that is used as part of the skip screen.": "## O quadro que é usado como parte da tela de salto.", "## The frame that is used as part of the notify screen.": "## O quadro que é usado como parte da tela de notificação.", "## Should frame backgrounds be tiled?": "## Os planos de fundo dos quadros devem ser lado a lado?", "## Bars, Scrollbars, and Sliders": "## Barras, barras de rolagem e controles deslizantes", "## These control the look and size of bars, scrollbars, and sliders.": "## Controlam a aparência e o tamanho das barras, barras de rolagem e controles deslizantes.", "## The default GUI only uses sliders and vertical scrollbars. All of the other bars are only used in creator-written screens.": "## A GUI padrão usa apenas controles deslizantes e barras de rolagem verticais. Todas as outras barras são usadas somente em telas escritas pelo criador.", "## The height of horizontal bars, scrollbars, and sliders. The width of vertical bars, scrollbars, and sliders.": "## A altura das barras horizontais, barras de rolagem e controles deslizantes. A largura das barras verticais, barras de rolagem e controles deslizantes.", "## True if bar images should be tiled. False if they should be linearly scaled.": "## True (verdadeiro) se as imagens da barra devem ser lado a lado. False se elas devem ser escalonadas linearmente.", "## Horizontal borders.": "## Bordas horizontais.", "## Vertical borders.": "## Bordas verticais.", "## What to do with unscrollable scrollbars in the gui. \"hide\" hides them, while None shows them.": "## O que fazer com as barras de rolagem não roláveis na interface gráfica. \"hide\" as oculta, enquanto \"None\" as mostra.", "## History": "## Histórico", "## The history screen displays dialogue that the player has already dismissed.": "## A tela de histórico exibe o diálogo que o jogador já dispensou.", "## The number of blocks of dialogue history Ren'Py will keep.": "## O número de blocos de histórico de diálogo que Ren'Py manterá.", "## The height of a history screen entry, or None to make the height variable at the cost of performance.": "## A altura de uma entrada de tela de histórico ou Nenhum para tornar a altura variável ao custo do desempenho.", "## The position, width, and alignment of the label giving the name of the speaking character.": "## A posição, a largura e o alinhamento do rótulo que fornece o nome do caractere falante.", "## The position, width, and alignment of the dialogue text.": "## A posição, a largura e o alinhamento do texto da caixa de diálogo.", "## NVL-Mode": "## Modo NVL", "## The NVL-mode screen displays the dialogue spoken by NVL-mode characters.": "## A tela do modo NVL exibe o diálogo falado pelos personagens do modo NVL.", "## The borders of the background of the NVL-mode background window.": "## As bordas do plano de fundo da janela de plano de fundo do modo NVL.", "## The maximum number of NVL-mode entries Ren'Py will display. When more entries than this are to be show, the oldest entry will be removed.": "## O número máximo de entradas do modo NVL que o Ren'Py exibirá. Quando mais entradas do que isso forem exibidas, a entrada mais antiga será removida.", "## The height of an NVL-mode entry. Set this to None to have the entries dynamically adjust height.": "## A altura de uma entrada no modo NVL. Defina como None para que as entradas ajustem a altura dinamicamente.", "## The spacing between NVL-mode entries when gui.nvl_height is None, and between NVL-mode entries and an NVL-mode menu.": "## O espaçamento entre as entradas do modo NVL quando gui.nvl_height é Nenhum e entre as entradas do modo NVL e um menu do modo NVL.", "## The position, width, and alignment of nvl_thought text (the text said by the nvl_narrator character.)": "## A posição, a largura e o alinhamento do texto nvl_thought (o texto dito pelo caractere nvl_narrator).", "## The position of nvl menu_buttons.": "## A posição dos botões de menu nvl.", "## Localization": "## Localização", "## This controls where a line break is permitted. The default is suitable for most languages. A list of available values can be found at https://www.renpy.org/doc/html/style_properties.html#style-property-language": "## Isso controla onde é permitida uma quebra de linha. O padrão é adequado para a maioria dos idiomas. Uma lista de valores disponíveis pode ser encontrada em https://www.renpy.org/doc/html/style_properties.html#style-property-language", "## Mobile devices": "## Dispositivos móveis", "## This increases the size of the quick buttons to make them easier to touch on tablets and phones.": "## Isso aumenta o tamanho dos botões rápidos para torná-los mais fáceis de tocar em tablets e telefones.", "## This changes the size and spacing of various GUI elements to ensure they are easily visible on phones.": "## Isso altera o tamanho e o espaçamento de vários elementos da GUI para garantir que eles sejam facilmente visíveis nos telefones.", "## Font sizes.": "## Tamanhos de fonte.", "## Adjust the location of the textbox.": "## Ajustar o local da caixa de texto.", "## Change the size and spacing of various things.": "## Altere o tamanho e o espaçamento de vários itens.", "## File button layout.": "## Layout do botão Arquivo.", "## NVL-mode.": "## Modo NVL.", "Documentation": "Documentação", "Ren'Py Website": "Site Ren'Py", "Ren'Py Games List": "Lista de jogos Ren'Py", "About": "Sobre", "update": "atualizar", "preferences": "preferências", "quit": "sair", "Yes": "Sim", "No": "Não", "Back": "Voltar", "Cancel": "Cancelar", "Continue": "Continuar", "Due to package format limitations, non-ASCII file and directory names are not allowed.": "Devido a limitações no pacote de formatação, não é permitido o nome de arquivos e pastas que não sejam ASCII", "ERROR": "ERRO", "While [what!qt], an error occured:": "Enquanto [what!qt], ocorreu um erro:", "Text input may not contain the {{ or [[ characters.": "A entrada de texto não pode conter caracteres {{ ou [[.", "File and directory names may not contain / or \\.": "Os nomes de arquivos e pastas não podem conter / ou \\.", "File and directory names must consist of ASCII characters.": "Os nomes de arquivos e pastas devem conter apenas caracteres ASCII.", "INFORMATION": "INFORMAÇÃO", "PROCESSING": "PROCESSANDO", "CHOICE": "SELECIONAR", "To build iOS packages, please download renios, unzip it, and place it into the Ren'Py directory. Then restart the Ren'Py launcher.": "Para criar pacotes iOS, faça o download drenios, extraia-o e coloque-o no diretório Ren'Py. Em seguida, reinicie o launcher Ren'Py.", "The directory in where Xcode projects will be placed has not been selected. Choose 'Select Directory' to select it.": "O diretório no qual os projetos Xcode serão colocados não foi selecionado. Escolha 'Selecionar Diretório' para selecioná-lo.", "There is no Xcode project corresponding to the current Ren'Py project. Choose 'Create Xcode Project' to create one.": "Não existe nenhum projeto Xcode correspondente ao projeto Ren'Py atual. Escolha 'Criar projeto Xcode' para criar um.", "An Xcode project exists. Choose 'Update Xcode Project' to update it with the latest game files, or use Xcode to build and install it.": "Existe um projecto Xcode. Escolha 'Update Xcode Project' para atualizá-lo com os arquivos de jogos mais recentes, ou use o Xcode para construí-lo e instalá-lo.", "Attempts to emulate an iPhone.\n\nTouch input is emulated through the mouse, but only when the button is held down.": "Tentativas de emular um iPhone.\n\nTouch são emuladas através do mouse, mas somente quando o botão é mantido pressionado.", "Attempts to emulate an iPad.\n\nTouch input is emulated through the mouse, but only when the button is held down.": "Tentativas de emular um iPad.\n\nTouch são emuladas através do mouse, mas somente quando o botão é mantido pressionado.", "Selects the directory where Xcode projects will be placed.": "Seleciona o diretório onde os projetos Xcode serão colocados.", "Creates an Xcode project corresponding to the current Ren'Py project.": "Cria um projeto Xcode correspondente ao projeto Ren'Py atual.", "Updates the Xcode project with the latest game files. This must be done each time the Ren'Py project changes.": "Atualiza o projeto Xcode com os arquivos de jogos mais recentes. Isso deve ser feito sempre que o projeto Ren'Py mudar.", "Opens the Xcode project in Xcode.": "Abre o projeto Xcode no Xcode.", "Opens the directory containing Xcode projects.": "Abre o diretório que contém projetos Xcode.", "The Xcode project already exists. Would you like to rename the old project, and replace it with a new one?": "O projeto Xcode já existe. Deseja renomear o projeto antigo e substituí-lo por um novo?", "Select Xcode Projects Directory": "Selecionar diretório de Projetos Xcode", "Create Xcode Project": "Criar Projeto Xcode", "Update Xcode Project": "Atualizar Projeto Xcode", "Launch Xcode": "Executar Xcode", "Open Xcode Projects Directory": "Abrir Diretório de Projetos Xcode", "Before packaging iOS apps, you'll need to download renios, Ren'Py's iOS support. Would you like to download renios now?": "Antes de empacotar aplicativos iOS, você precisará baixar renios, o suporte a iOS do Ren'Py. Gostaria de fazer o download do renios agora?", "XCODE PROJECTS DIRECTORY": "DIRETÓRIO DE PROJETOS XCODE", "Please choose the Xcode Projects Directory using the directory chooser.\n{b}The directory chooser may have opened behind this window.{/b}": "Escolha o Diretório de Projetos Xcode usando o seletor de diretório. \n{b}O seletor de diretório pode ter aberto atrás desta janela.{/b}", "Ren'Py has set the Xcode Projects Directory to:": "Ren'Py definiu o Diretório de Projetos Xcode para: ", "The file name may not be empty.": "O nome do arquivo não pode estar vazio.", "A 64-bit/x64 Java [JDK_REQUIREMENT] Development Kit is required to build Android packages on Windows. The JDK is different from the JRE, so it's possible you have Java without having the JDK.\n\nPlease {a=https://www.renpy.org/jdk/[JDK_REQUIREMENT]}download and install the JDK{/a}, then restart the Ren'Py launcher.": "É necessário um kit de desenvolvimento Java [JDK_REQUIREMENT] de 64 bits/x64 para criar pacotes Android no Windows. O JDK é diferente do JRE, portanto, é possível que você tenha o Java sem ter o JDK.\n\nFaça o download do {a=https://www.renpy.org/jdk/[JDK_REQUIREMENT]}e instale o JDK{/a} e, em seguida, reinicie o Ren'Py launcher.", "RAPT has been installed, but a key hasn't been configured. Please generate new keys, or copy android.keystore and bundle.keystore to the base directory.": "O RAPT foi instalado, mas uma chave não foi configurada. Gere novas chaves ou copie android.keystore e bundle.keystore para o diretório base.", "Please select if you want a Play Bundle (for Google Play), or a Universal APK (for sideloading and other app stores).": "Selecione se deseja um Play Bundle (para o Google Play) ou um APK universal (para sideload e outras lojas de aplicativos).", "Attempts to emulate a televison-based Android console.\n\nController input is mapped to the arrow keys, Enter is mapped to the select button, Escape is mapped to the menu button, and PageUp is mapped to the back button.": "Tentativa de emular um console Android baseado em televisão.\n\nA entrada do controlador é mapeada para as teclas de seta, Enter é mapeado para o botão de seleção, Escape é mapeado para o botão de menu e PageUp é mapeado para o botão de voltar.", "Downloads and installs the Android SDK and supporting packages.": "Faz o download e instala o Android SDK e os pacotes de suporte.", "Generates the keys required to sign the package.": "Gera as chaves necessárias para assinar o pacote.", "Retrieves the log from the Android device and writes it to a file.": "Recupera o registro do dispositivo Android e o grava em um arquivo.", "Lists the connected devices.": "Lista os dispositivos conectados.", "Pairs with a device over Wi-Fi, on Android 11+.": "Emparelha-se com um dispositivo por Wi-Fi, no Android 11+.", "Connects to a device over Wi-Fi, on Android 11+.": "Conecta-se a um dispositivo por Wi-Fi, no Android 11+.", "Disconnects a device connected over Wi-Fi.": "Desconecta um dispositivo conectado por Wi-Fi.", "Removes Android temporary files.": "Remove os arquivos temporários do Android.", "Builds an Android App Bundle (ABB), intended to be uploaded to Google Play. This can include up to 2GB of data.": "Cria um pacote de aplicativos para Android (ABB), destinado a ser carregado no Google Play. Isso pode incluir até 2 GB de dados.", "Builds a Universal APK package, intended for sideloading and stores other than Google Play. This can include up to 2GB of data.": "Constrói um pacote APK universal, destinado ao sideload e a outras lojas além do Google Play. Isso pode incluir até 2 GB de dados.", "Copying Android files to distributions directory.": "Copiar arquivos do Android para o diretório de distribuições.", "Install SDK": "Instalar o SDK", "Generate Keys": "Gerar chaves", "List Devices": "Dispositivos de lista", "Wi-Fi Debugging Pair": "Par de depuração de Wi-Fi", "Wi-Fi Debugging Connect": "Conexão de depuração de Wi-Fi", "Wi-Fi Debugging Disconnect": "Desconexão da depuração de Wi-Fi", "Clean": "Limpo", "Retrieving logcat information from device.": "Recuperação de informações de logcat do dispositivo.", "Wi-Fi Pairing Code": "Código de emparelhamento Wi-Fi", "If supported, this can be found in 'Developer options', 'Wireless debugging', 'Pair device with pairing code'.": "Se houver suporte, isso poderá ser encontrado em \"Developer options\" (Opções do desenvolvedor), \"Wireless debugging\" (Depuração sem fio), \"Pair device with pairing code\" (Emparelhar dispositivo com código de emparelhamento).", "Pairing Host & Port": "Emparelhamento de host e porta", "IP Address & Port": "Endereço IP e porta", "If supported, this can be found in 'Developer options', 'Wireless debugging'.": "Se houver suporte, isso poderá ser encontrado em \"Opções do desenvolvedor\", \"Depuração sem fio\".", "This can be found in 'List Devices'.": "Isso pode ser encontrado em \"List Devices\" (Listar dispositivos).", "Cleaning up Android project.": "Limpeza do projeto Android.", "{} is not a directory.": "{} não é um diretório.", "{} does not contain a Ren'Py game.": "{} não contém um jogo Ren'Py.", "Run configure before attempting to build the app.": "Execute o configure antes de tentar criar o aplicativo.", "Updating project.": "Atualizando o projeto.", "Creating assets directory.": "Criação do diretório de ativos.", "Packaging internal data.": "Embalagem de dados internos.", "I'm using Gradle to build the package.": "Estou usando o Gradle para criar o pacote.", "The build seems to have failed.": "A compilação parece ter falhado.", "I'm installing the bundle.": "Estou instalando o pacote.", "Installing the bundle appears to have failed.": "A instalação do pacote parece ter falhado.", "Launching app.": "Iniciando o aplicativo.", "Launching the app appears to have failed.": "A inicialização do aplicativo parece ter falhado.", "The build seems to have succeeded.": "A construção parece ter sido bem-sucedida.", "What is the full name of your application? This name will appear in the list of installed applications.": "Qual é o nome completo do seu aplicativo? Esse nome aparecerá na lista de aplicativos instalados.", "What is the short name of your application? This name will be used in the launcher, and for application shortcuts.": "Qual é o nome abreviado do seu aplicativo? Esse nome será usado no inicializador e nos atalhos do aplicativo.", "What is the name of the package?\n\nThis is usually of the form com.domain.program or com.domain.email.program. It may only contain ASCII letters and dots. It must contain at least one dot.": "Qual é o nome do pacote?\n\nGeralmente, esse nome tem o formato com.domain.program ou com.domain.email.program. Pode conter apenas letras ASCII e pontos. Deve conter pelo menos um ponto.", "The package name may not be empty.": "O nome do pacote não pode estar vazio.", "The package name may not contain spaces.": "O nome do pacote não pode conter espaços.", "The package name must contain at least one dot.": "O nome do pacote deve conter pelo menos um ponto.", "The package name may not contain two dots in a row, or begin or end with a dot.": "O nome do pacote não pode conter dois pontos em uma linha, nem começar ou terminar com um ponto.", "Each part of the package name must start with a letter, and contain only letters, numbers, and underscores.": "Cada parte do nome do pacote deve começar com uma letra e conter apenas letras, números e sublinhados.", "{} is a Java keyword, and can't be used as part of a package name.": "{} é uma palavra-chave Java e não pode ser usada como parte de um nome de pacote.", "What is the application's version?\n\nThis should be the human-readable version that you would present to a person. It must contain only numbers and dots.": "Qual é a versão do aplicativo?\n\nEssa deve ser a versão legível para humanos que você apresentaria a uma pessoa. Ela deve conter apenas números e pontos.", "The version number must contain only numbers and dots.": "O número da versão deve conter apenas números e pontos.", "How much RAM (in GB) do you want to allocate to Gradle?\nThis must be a positive integer number.": "Qual a quantidade de RAM (em GB) que você deseja alocar para o Gradle?\nEsse deve ser um número inteiro positivo.", "The RAM size must contain only numbers and be positive.": "O tamanho da RAM deve conter apenas números e ser positivo.", "How would you like your application to be displayed?": "Como você gostaria que seu aplicativo fosse exibido?", "In landscape orientation.": "Na orientação paisagem.", "In portrait orientation.": "Na orientação retrato.", "In the user's preferred orientation.": "Na orientação preferida do usuário.", "Which app store would you like to support in-app purchasing through?": "Em qual loja de aplicativos você gostaria de oferecer suporte para compras no aplicativo?", "Both, in one app.": "Ambos, em um único aplicativo.", "Neither.": "Nenhum deles.", "Do you want to automatically update the Java source code?": "Deseja atualizar automaticamente o código-fonte Java?", "Yes. This is the best choice for most projects.": "Sim. Essa é a melhor opção para a maioria dos projetos.", "No. This may require manual updates when Ren'Py or the project configuration changes.": "Não. Isso pode exigir atualizações manuais quando o Ren'Py ou a configuração do projeto for alterada.", "Unknown configuration variable: {}": "Variável de configuração desconhecida: {}", "I'm compiling a short test program, to see if you have a working JDK on your system.": "Estou compilando um pequeno programa de teste para verificar se você tem um JDK funcional em seu sistema.", "I was unable to use javac to compile a test file. If you haven't installed the Java Development Kit yet, please download it from:\n\n{a=https://adoptium.net/?variant=openjdk8}https://adoptium.net/?variant=openjdk8{/a}\n\nThe JDK is different from the JRE, so it's possible you have Java without having the JDK. Please make sure you installed the 'JavaSoft (Oracle) registry keys'.\n\nWithout a working JDK, I can't continue.": "Não consegui usar o javac para compilar um arquivo de teste. Se você ainda não instalou o Java Development Kit, faça o download em:\n\n{a=https://adoptium.net/?variant=openjdk8}https://adoptium.net/?variant=openjdk8{/a}\n\nO JDK é diferente do JRE, portanto, é possível que você tenha o Java sem ter o JDK. Certifique-se de ter instalado as \"chaves de registro JavaSoft (Oracle)\".\n\nSem um JDK funcional, não posso continuar.", "The version of Java on your computer does not appear to be JDK 8, which is the only version supported by the Android SDK. If you need to install JDK 8, you can download it from:\n\n{a=https://adoptium.net/?variant=openjdk8}https://adoptium.net/?variant=openjdk8{/a}\n\nYou can also set the JAVA_HOME environment variable to use a different version of Java.": "A versão do Java em seu computador não parece ser o JDK 8, que é a única versão compatível com o SDK do Android. Se precisar instalar o JDK 8, você pode baixá-lo em:\n\n{a=https://adoptium.net/?variant=openjdk8}https://adoptium.net/?variant=openjdk8{/a}\n\nVocê também pode definir a variável de ambiente JAVA_HOME para usar uma versão diferente do Java.", "The JDK is present and working. Good!": "O JDK está presente e funcionando. Ótimo!", "The Android SDK has already been unpacked.": "O SDK do Android já foi descompactado.", "Do you accept the Android SDK Terms and Conditions?": "Você aceita os Termos e Condições do Android SDK?", "I'm downloading the Android SDK. This might take a while.": "Estou baixando o SDK do Android. Isso pode demorar um pouco.", "I'm extracting the Android SDK.": "Estou extraindo o SDK do Android.", "I've finished unpacking the Android SDK.": "Terminei de descompactar o Android SDK.", "I'm about to download and install the required Android packages. This might take a while.": "Estou prestes a baixar e instalar os pacotes Android necessários. Isso pode demorar um pouco.", "I was unable to accept the Android licenses.": "Não consegui aceitar as licenças do Android.", "I was unable to install the required Android packages.": "Não consegui instalar os pacotes Android necessários.", "I've finished installing the required Android packages.": "Terminei de instalar os pacotes necessários do Android.", "It looks like you're ready to start packaging games.": "Parece que você está pronto para começar a empacotar jogos.", "Please enter your name or the name of your organization.": "Digite seu nome ou o nome de sua organização.", "I found an android.keystore file in the rapt directory. Do you want to use this file?": "Encontrei um arquivo android.keystore no diretório rapt. Você deseja usar esse arquivo?", "I can create an application signing key for you. This key is required to create Universal APK for sideloading and stores other than Google Play.\n\nDo you want to create a key?": "Posso criar uma chave de assinatura de aplicativo para você. Essa chave é necessária para criar o APK universal para sideload e outras lojas além do Google Play.\n\nVocê deseja criar uma chave?", "I will create the key in the android.keystore file.\n\nYou need to back this file up. If you lose it, you will not be able to upgrade your application.\n\nYou also need to keep the key safe. If evil people get this file, they could make fake versions of your application, and potentially steal your users' data.\n\nWill you make a backup of android.keystore, and keep it in a safe place?": "Criarei a chave no arquivo android.keystore.\n\nVocê precisa fazer o backup desse arquivo. Se o perder, não será possível atualizar o aplicativo.\n\nVocê também precisa manter a chave segura. Se pessoas mal-intencionadas obtiverem esse arquivo, elas poderão criar versões falsas do seu aplicativo e, possivelmente, roubar os dados dos seus usuários.\n\nVocê fará um backup do android.keystore e o manterá em um local seguro?", "\n\nSaying 'No' will prevent key creation.": "\n\nA resposta \"Não\" impedirá a criação da chave.", "Could not create android.keystore. Is keytool in your path?": "Não foi possível criar android.keystore. O keytool está em seu caminho?", "I've finished creating android.keystore. Please back it up, and keep it in a safe place.": "Terminei de criar o arquivo android.keystore. Faça o backup e mantenha-o em um local seguro.", "I found a bundle.keystore file in the rapt directory. Do you want to use this file?": "Encontrei um arquivo bundle.keystore no diretório rapt. Você deseja usar esse arquivo?", "I can create a bundle signing key for you. This key is required to build an Android App Bundle (AAB) for upload to Google Play.\n\nDo you want to create a key?": "Posso criar uma chave de assinatura de pacote para você. Essa chave é necessária para criar um pacote de aplicativos para Android (AAB) para upload no Google Play.\n\nVocê deseja criar uma chave?", "I will create the key in the bundle.keystore file.\n\nYou need to back this file up. If you lose it, you will not be able to upgrade your application.\n\nYou also need to keep the key safe. If evil people get this file, they could make fake versions of your application, and potentially steal your users' data.\n\nWill you make a backup of bundle.keystore, and keep it in a safe place?": "Criarei a chave no arquivo bundle.keystore.\n\nVocê precisa fazer o backup desse arquivo. Se o perder, não será possível atualizar o aplicativo.\n\nVocê também precisa manter a chave segura. Se pessoas mal-intencionadas obtiverem esse arquivo, elas poderão criar versões falsas do seu aplicativo e, possivelmente, roubar os dados dos seus usuários.\n\nVocê fará um backup do bundle.keystore e o manterá em um local seguro?", "Could not create bundle.keystore. Is keytool in your path?": "Não foi possível criar o bundle.keystore. O keytool está em seu caminho?", "I've opened the directory containing android.keystore and bundle.keystore. Please back them up, and keep them in a safe place.": "Abri o diretório que contém android.keystore e bundle.keystore. Faça backup deles e mantenha-os em um local seguro.", "Select Projects Directory": "Selecione o diretório de projetos", "The selected projects directory is not writable.": "O diretório de projetos selecionado não pode ser gravado.", "changing the theme": "Alterando o tema", "The command is being run in a new operating system console window.": "O comando está sendo executado em uma nova janela de console do sistema operacional.", "Unpacking the Macintosh application for signing...": "Desembalagem do aplicativo Macintosh para assinatura...", "Signing the Macintosh application...\n(This may take a long time.)": "Assinatura do aplicativo Macintosh...\n(Isso pode levar muito tempo).", "Creating the Macintosh DMG...": "Criando o DMG do Macintosh...", "Signing the Macintosh DMG...": "Assinatura do DMG do Macintosh...", "Copying files...": "Cópia de arquivos...", "Build Distributions: [project.current.display_name!q]": "Construir distribuições: [project.current.display_name!q]", "Update old-game": "Atualizar o jogo antigo", "Upload to itch.io": "Fazer upload para o itch.io", "Ren'Py is running from a read only folder. Some functionality will not work.": "O Ren'Py está sendo executado em uma pasta somente leitura. Algumas funcionalidades não funcionarão.", "This is probably because Ren'Py is running directly from a Macintosh drive image. To fix this, quit this launcher, copy the entire %s folder somewhere else on your computer, and run Ren'Py again.": "Isso provavelmente ocorre porque o Ren'Py está sendo executado diretamente de uma imagem de unidade do Macintosh. Para corrigir isso, saia do inicializador, copie toda a pasta %s em outro lugar do computador e execute o Ren'Py novamente.", "A modern editor with many extensions including advanced Ren'Py integration.": "Um editor moderno com muitas extensões, incluindo integração avançada com o Ren'Py.", "A modern editor with many extensions including advanced Ren'Py integration.\n{a=jump:reinstall_vscode}Upgrade Visual Studio Code to the latest version.{/a}": "Um editor moderno com muitas extensões, incluindo integração avançada com o Ren'Py.\n{a=jump:reinstall_vscode}Atualize o Visual Studio Code para a versão mais recente.{/a}", "Up to 110 MB download required.": "É necessário fazer download de até 110 MB.", "A modern and approachable text editor.": "Um editor de texto moderno e acessível.", "Up to 150 MB download required.": "É necessário fazer download de até 150 MB.", "Visual Studio Code (System)": "Visual Studio Code (sistema)", "Uses a copy of Visual Studio Code that you have installed outside of Ren'Py. It's recommended you install the language-renpy extension to add support for Ren'Py files.": "Usa uma cópia do Visual Studio Code que você instalou fora do Ren'Py. Recomenda-se que você instale a extensão language-renpy para adicionar suporte aos arquivos Ren'Py.", "Edit [text].": "Editar [text].", "Open project": "Projeto aberto", "Actions": "Ações", "Change/Update GUI": "GUI de alteração/atualização", "Select Accent and Background Colors": "Selecionar cores de destaque e de fundo", "Please click on the color scheme you wish to use, then click Continue. These colors can be changed and customized later.": "Clique no esquema de cores que deseja usar e, em seguida, clique em Continue (Continuar). Essas cores podem ser alteradas e personalizadas posteriormente.", "{b}Warning{/b}\nContinuing will overwrite customized bar, button, save slot, scrollbar, and slider images.\n\nWhat would you like to do?": "{b}Advertência{/b}\nA continuação substituirá as imagens personalizadas da barra, do botão, do slot de salvamento, da barra de rolagem e do controle deslizante.\n\nO que você gostaria de fazer?", "{size=-4}\n\nThis will not overwrite gui/main_menu.png, gui/game_menu.png, and gui/window_icon.png, but will create files that do not exist.{/size}": "{size=-4}\n\nIsso não sobrescreverá gui/main_menu.png, gui/game_menu.png e gui/window_icon.png, mas criará arquivos que não existem.{/size}", "Choose new colors, then regenerate image files.": "Escolha novas cores e, em seguida, gere novamente os arquivos de imagem.", "Regenerate the image files using the colors in gui.rpy.": "Gerar novamente os arquivos de imagem usando as cores em gui.rpy.", "What resolution should the project use? Although Ren'Py can scale the window up and down, this is the initial size of the window, the size at which assets should be drawn, and the size at which the assets will be at their sharpest.\n\nThe default of [default_size[0]]x[default_size[1]] is a reasonable compromise.": "Qual resolução o projeto deve usar? Embora o Ren'Py possa dimensionar a janela para cima e para baixo, esse é o tamanho inicial da janela, o tamanho no qual os recursos devem ser desenhados e o tamanho no qual os recursos estarão mais nítidos.\n\nO padrão de [default_size[0]]x[default_size[1]] é um compromisso razoável.", "Custom. The GUI is optimized for a 16:9 aspect ratio.": "Personalizado. A GUI é otimizada para uma proporção de 16:9.", "WIDTH": "LARGURA", "Please enter the width of your game, in pixels.": "Digite a largura do seu jogo, em pixels.", "The width must be a number.": "A largura deve ser um número.", "HEIGHT": "ALTURA", "Please enter the height of your game, in pixels.": "Digite a altura do seu jogo, em pixels.", "The height must be a number.": "A altura deve ser um número.", "Creating the new project...": "Criando o novo projeto...", "Updating the project...": "Atualizar o projeto...", "creating a new project": "Criando um novo projeto", "activating the new project": "ativação do novo projeto", "Could not install [name!t], as a file matching [zipglob] was not found in the Ren'Py SDK directory.": "Não foi possível instalar [name!t], pois um arquivo correspondente a [zipglob] não foi encontrado no diretório Ren'Py SDK.", "Successfully installed [name!t].": "Instalado com sucesso [name!t].", "This screen allows you to install libraries that can't be distributed with Ren'Py. Some of these libraries may require you to agree to a third-party license before being used or distributed.": "Essa tela permite que você instale bibliotecas que não podem ser distribuídas com o Ren'Py. Algumas dessas bibliotecas podem exigir que você concorde com uma licença de terceiros antes de serem usadas ou distribuídas.", "Install Steam Support": "Instalar o suporte ao Steam", "Before installing Steam support, please make sure you are a {a=https://partner.steamgames.com/}Steam partner{/a}.": "Antes de instalar o suporte do Steam, certifique-se de que você é um parceiro do Steam {a=https://partner.steamgames.com/}{/a} .", "Steam support has already been installed.": "O suporte ao Steam já foi instalado.", "Install Live2D Cubism SDK for Native": "Instalar o Live2D Cubism SDK para Native", "Install Libraries": "Instalar bibliotecas", "The {a=https://www.live2d.com/en/download/cubism-sdk/download-native/}Cubism SDK for Native{/a} adds support for displaying Live2D models. Place CubismSdkForNative-4-{i}version{/i}.zip in the Ren'Py SDK directory, and then click Install. Distributing a game with Live2D requires you to accept a license from Live2D, Inc.": "O {a=https://www.live2d.com/en/download/cubism-sdk/download-native/}Cubism SDK for Native{/a} adiciona suporte à exibição de modelos Live2D. Coloque o CubismSdkForNative-4-{i}versão{/i}.zip no diretório Ren'Py SDK e clique em Install (Instalar). A distribuição de um jogo com o Live2D exige que você aceite uma licença da Live2D, Inc.", "Live2D in Ren'Py doesn't support the Web, Android x86_64 (including emulators and Chrome OS), and must be added to iOS projects manually. Live2D must be reinstalled after upgrading Ren'Py or installing Android support.": "O Live2D no Ren'Py não é compatível com a Web, Android x86_64 (incluindo emuladores e Chrome OS) e deve ser adicionado manualmente aos projetos iOS. O Live2D deve ser reinstalado após a atualização do Ren'Py ou a instalação do suporte ao Android.", "Open Ren'Py SDK Directory": "Abrir o diretório Ren'Py SDK", "Downloading [extension.download_file].": "Fazendo download de [extension.download_file].", "Could not download [extension.download_file] from [extension.download_url]:\n{b}[extension.download_error]": "Não foi possível fazer o download do site [extension.download_file] em [extension.download_url]:\n{b}[extension.download_error]", "The downloaded file [extension.download_file] from [extension.download_url] is not correct.": "O arquivo baixado [extension.download_file] de [extension.download_url] não está correto.", "Ren'Py Sponsor Information": "Informações do patrocinador Ren'Py", "opening the log file": "abrir o arquivo de registro", "There are known issues with the iOS simulator on Apple Silicon. Please test on x86_64 or iOS devices.": "Há problemas conhecidos com o simulador de iOS no Apple Silicon. Faça o teste em dispositivos x86_64 ou iOS.", "Downloading the itch.io butler.": "Baixando o mordomo do itch.io.", "The built distributions could not be found. Please choose 'Build' and try again.": "Não foi possível encontrar as distribuições criadas. Selecione \"Build\" e tente novamente.", "No uploadable files were found. Please choose 'Build' and try again.": "Não foram encontrados arquivos para upload. Escolha 'Build' e tente novamente.", "The butler program was not found.": "O programa butler não foi encontrado.", "Please install the itch.io app, which includes butler, and try again.": "Instale o aplicativo itch.io, que inclui o butler, e tente novamente.", "The name of the itch project has not been set.": "O nome do projeto itch ainda não foi definido.", "Please {a=https://itch.io/game/new}create your project{/a}, then add a line like \n{vspace=5}define build.itch_project = \"user-name/game-name\"\n{vspace=5} to options.rpy.": "Por favor, {a=https://itch.io/game/new}crie seu projeto{/a} e, em seguida, adicione uma linha como \n{vspace=5}define build.itch_project = \"user-name/game-name\"\n{vspace=5} para options.rpy.", "Navigate: [project.current.display_name!q]": "Navegar: [project.current.display_name!q]", "New GUI Interface": "Nova interface gráfica", "Both interfaces have been translated to your language.": "Ambas as interfaces foram traduzidas para seu idioma.", "Only the new GUI has been translated to your language.": "Somente a nova GUI foi traduzida para seu idioma.", "Only the legacy theme interface has been translated to your language.": "Somente a interface do tema herdado foi traduzida para seu idioma.", "Neither interface has been translated to your language.": "Nenhuma das interfaces foi traduzida para seu idioma.", "Which interface would you like to use? The new GUI has a modern look, supports wide screens and mobile devices, and is easier to customize. Legacy themes might be necessary to work with older example code.\n\n[language_support!t]\n\nIf in doubt, choose the new GUI, then click Continue on the bottom-right.": "Qual interface você gostaria de usar? A nova GUI tem um visual moderno, suporta telas largas e dispositivos móveis e é mais fácil de personalizar. Pode ser necessário usar temas herdados para trabalhar com códigos de exemplo mais antigos.\n\n[language_support!t]\n\nEm caso de dúvida, escolha a nova GUI e clique em Continue (Continuar) no canto inferior direito.", "Legacy Theme Interface": "Interface do tema legado", "You will be creating an [new_project_language]{#this substitution may be localized} language project. Change the launcher language in preferences to create a project in another language.": "Você estará criando um projeto no idioma [new_project_language]{#this substitution may be localized}. Altere o idioma do inicializador nas preferências para criar um projeto em outro idioma.", "General": "Geral", "Options": "Opções", "Sponsor message": "Mensagem do patrocinador", "Daily check for update": "Verificação diária de atualização", "Launcher Theme:": "Tema do iniciador:", "Default theme": "Tema padrão", "Dark theme": "Tema escuro", "Custom theme": "Tema personalizado", "Information about creating a custom theme can be found {a=https://www.renpy.org/doc/html/skins.html}in the Ren'Py Documentation{/a}.": "Informações sobre a criação de um tema personalizado podem ser encontradas em {a=https://www.renpy.org/doc/html/skins.html}na documentação do Ren'Py{/a}.", "Install Libraries:": "Instalar bibliotecas:", "Reset window size": "Redefinir o tamanho da janela", "Clean temporary files": "Limpar arquivos temporários", "Cleaning temporary files...": "Limpeza de arquivos temporários...", "{#in language font}Welcome! Please choose a language": "{#in language font}Bem-vindo! Por favor, escolha um idioma", "{#in language font}Start using Ren'Py in [lang_name]": "{#in language font}Comece a usar o Ren'Py em [lang_name]", "Lint checks your game for potential mistakes, and gives you statistics.": "O Lint verifica seu jogo em busca de possíveis erros e fornece estatísticas.", "This may be because the project is not writeable.": "Isso pode ocorrer porque o projeto não pode ser gravado.", "Translations: [project.current.display_name!q]": "Traduções: [project.current.display_name!q]", "The language to work with. This should only contain lower-case ASCII characters and underscores.": "O idioma com o qual trabalhar. Deve conter apenas caracteres ASCII minúsculos e sublinhados.", "Generates or updates translation files. The files will be placed in game/tl/[persistent.translate_language!q].": "Gera ou atualiza arquivos de tradução. Os arquivos serão colocados em game/tl/[persistent.translate_language!q].", "Extract String Translations": "Extrair traduções de strings", "Merge String Translations": "Mesclar traduções de strings", "Replace existing translations": "Substituir traduções existentes", "Reverse languages": "Reverter idiomas", "Update Default Interface Translations": "Atualizar traduções de interface padrão", "The extract command allows you to extract string translations from an existing project into a temporary file.\n\nThe merge command merges extracted translations into another project.": "O comando extract permite extrair traduções de strings de um projeto existente para um arquivo temporário.\n\nO comando merge mescla as traduções extraídas em outro projeto.", "Ren'Py is extracting string translations...": "Ren'Py está extraindo traduções de strings...", "Ren'Py has finished extracting [language] string translations.": "Ren'Py terminou de extrair as traduções das strings do [language].", "Ren'Py is merging string translations...": "Ren'Py está mesclando traduções de strings...", "Ren'Py has finished merging [language] string translations.": "Ren'Py terminou de mesclar as traduções de strings do [language].", "Updating default interface translations...": "Atualização das traduções de interface padrão...", "Extract Dialogue: [project.current.display_name!q]": "Extrair diálogo: [project.current.display_name!q]", "Format:": "Formato:", "Tab-delimited Spreadsheet (dialogue.tab)": "Planilha delimitada por tabulação (dialogue.tab)", "Dialogue Text Only (dialogue.txt)": "Somente texto de diálogo (dialogue.txt)", "Strip text tags from the dialogue.": "Retire as tags de texto do diálogo.", "Escape quotes and other special characters.": "Escape aspas e outros caracteres especiais.", "Extract all translatable strings, not just dialogue.": "Extraia todas as cadeias de caracteres traduzíveis, não apenas o diálogo.", "Language (or None for the default language):": "Idioma (ou Nenhum para o idioma padrão):", "Ren'Py has finished extracting dialogue. The extracted dialogue can be found in dialogue.[persistent.dialogue_format] in the base directory.": "Ren'Py terminou de extrair o diálogo. O diálogo extraído pode ser encontrado em dialogue.[persistent.dialogue_format] no diretório base.", "Release (Ren'Py 8, Python 3)": "Versão (Ren'Py 8, Python 3)", "Release (Ren'Py 7, Python 2)": "Versão (Ren'Py 7, Python 2)", "Prerelease (Ren'Py 8, Python 3)": "Pré-lançamento (Ren'Py 8, Python 3)", "Prerelease (Ren'Py 7, Python 2)": "Pré-lançamento (Ren'Py 7, Python 2)", "Nightly (Ren'Py 8, Python 3)": "Todas as noites (Ren'Py 8, Python 3)", "Nightly (Ren'Py 7, Python 2)": "Noturno (Ren'Py 7, Python 2)", "The update channel controls the version of Ren'Py the updater will download.": "O canal de atualização controla a versão do Ren'Py que o atualizador baixará.", "• {a=https://www.renpy.org/doc/html/changelog.html}View change log{/a}": "- {a=https://www.renpy.org/doc/html/changelog.html}Exibir registro de alterações{/a}", "• {a=https://www.renpy.org/dev-doc/html/changelog.html}View change log{/a}": "- {a=https://www.renpy.org/dev-doc/html/changelog.html}Exibir registro de alterações{/a}", "• This version is installed and up-to-date.": "- Essa versão está instalada e atualizada.", "Fetching the list of update channels": "Obtenção da lista de canais de atualização", "downloading the list of update channels": "fazer o download da lista de canais de atualização", "Preparing progressive download": "Preparando o download progressivo", "Creating package...": "Criação de pacote...", "Build Web Application": "Criar aplicativo da Web", "Build and Open in Browser": "Criar e abrir no navegador", "Open in Browser": "Abrir no navegador", "Open build directory": "Abrir o diretório de compilação", "Images and music can be downloaded while playing. A 'progressive_download.txt' file will be created so you can configure this behavior.": "Imagens e músicas podem ser baixadas durante a reprodução. Um arquivo \"progressive_download.txt\" será criado para que você possa configurar esse comportamento.", "Before packaging web apps, you'll need to download RenPyWeb, Ren'Py's web support. Would you like to download RenPyWeb now?": "Antes de empacotar aplicativos Web, você precisará baixar o RenPyWeb, o suporte Web do Ren'Py. Gostaria de fazer o download do RenPyWeb agora?", "A nightly build of fixes to the release version of Ren'Py.": "Uma compilação noturna de correções para a versão de lançamento do Ren'Py.", "Navigate: [project.current.name]": "Navegando por: [project.current.name]", "Order: ": "Ordem: ", "alphabetical": "alfabético", "by-file": "por arquivo", "Category:": "Categoría:", "files": "arquivos", "defines": "define", "transforms": "transformações", "screens": "telas", "callables": "chamáveis", "TODOs": "TAREFAS", "+ Add script file": "+ Adicionar um arquivo de script", "No TODO comments found.\n\nTo create one, include \"# TODO\" in your script.": "Não se encontrou comentários \"TODO\". Para criar um, inclua \"# TODO\" em seu script.", "The list of names is empty.": "A lista de nomes está vazia.", "Choose Project Template": "Escolha um template para o projeto", "Please select a template to use for your new project. The template sets the default font and the user interface language. If your language is not supported, choose 'english'.": "Por favor selecione um template para usar em seu novo projeto. O template estabelece uma fonte padrão e a linguagem da interface de usuário,Se o seu idioma não for suportado, escolha \"English\".", "PROJECT NAME": "NOME DO PROJETO", "Please enter the name of your project:": "Por favor introduza o nome do seu projeto:", "The project name may not be empty.": "O nome do projeto não pode estar vazio.", "[project_name!q] already exists. Please choose a different project name.": "[project_name!q] já existe. Por favor escolha um nome diferente para o projeto.", "[project_dir!q] already exists. Please choose a different project name.": "[project_dir!q] já existe. Por favor escolha um nome diferente para o projeto.", "The projects directory could not be set. Giving up.": "A pasta do projeto não pode ser colocada. Abandonando.", "{#language name and font}": "{font=fonts/Roboto-Light.ttf}Português{/font}", "## This file contains options that can be changed to customize your game.": "## Esse arquivo contém opções que podem ser alteradas para personalizar o jogo.", "## Lines beginning with two '#' marks are comments, and you shouldn't uncomment them. Lines beginning with a single '#' mark are commented-out code, and you may want to uncomment them when appropriate.": "## As linhas que começam com duas marcas '#' são comentários e você não deve descomentá-las. As linhas que começam com uma única marca '#' são códigos comentados, e você pode querer descomentá-las quando apropriado.", "## Basics": "## Noções básicas", "## A human-readable name of the game. This is used to set the default window title, and shows up in the interface and error reports.": "## Um nome do jogo legível por humanos. Ele é usado para definir o título padrão da janela e aparece na interface e nos relatórios de erros.", "## The _() surrounding the string marks it as eligible for translation.": "## O _() ao redor da string a marca como elegível para tradução.", "Ren'Py 7 Default GUI": "GUI padrão do Ren'Py 7", "## Determines if the title given above is shown on the main menu screen. Set this to False to hide the title.": "## Determina se o título fornecido acima será mostrado na tela do menu principal. Defina como False para ocultar o título.", "## The version of the game.": "## A versão do jogo.", "## Text that is placed on the game's about screen. Place the text between the triple-quotes, and leave a blank line between paragraphs.": "## Texto que é colocado na tela \"Sobre\" do jogo. Coloque o texto entre aspas triplas e deixe uma linha em branco entre os parágrafos.", "## A short name for the game used for executables and directories in the built distribution. This must be ASCII-only, and must not contain spaces, colons, or semicolons.": "## Um nome curto para o jogo usado para executáveis e diretórios na distribuição construída. Ele deve ser somente ASCII e não deve conter espaços, dois pontos ou ponto e vírgula.", "## Sounds and music": "## Sons e música", "## These three variables control, among other things, which mixers are shown to the player by default. Setting one of these to False will hide the appropriate mixer.": "## Essas três variáveis controlam, entre outras coisas, quais mixers são mostrados ao jogador por padrão. Definir uma delas como False ocultará o mixer apropriado.", "## To allow the user to play a test sound on the sound or voice channel, uncomment a line below and use it to set a sample sound to play.": "## Para permitir que o usuário reproduza um som de teste no canal de som ou voz, descomente a linha abaixo e use-a para definir um som de amostra a ser reproduzido.", "## Uncomment the following line to set an audio file that will be played while the player is at the main menu. This file will continue playing into the game, until it is stopped or another file is played.": "## Descomente a linha a seguir para definir um arquivo de áudio que será reproduzido enquanto o jogador estiver no menu principal. Esse arquivo continuará sendo reproduzido no jogo até que seja interrompido ou outro arquivo seja reproduzido.", "## Transitions": "## Transições", "## These variables set transitions that are used when certain events occur. Each variable should be set to a transition, or None to indicate that no transition should be used.": "## Essas variáveis definem as transições que são usadas quando determinados eventos ocorrem. Cada variável deve ser definida como uma transição ou None para indicar que nenhuma transição deve ser usada.", "## Entering or exiting the game menu.": "## Entrar ou sair do menu do jogo.", "## Between screens of the game menu.": "## Entre as telas do menu do jogo.", "## A transition that is used after a game has been loaded.": "## Uma transição que é usada depois que um jogo é carregado.", "## Used when entering the main menu after the game has ended.": "## Usado ao entrar no menu principal após o término do jogo.", "## A variable to set the transition used when the game starts does not exist. Instead, use a with statement after showing the initial scene.": "## Não existe uma variável para definir a transição usada quando o jogo começa. Em vez disso, use uma instrução with depois de mostrar a cena inicial.", "## Window management": "## Gerenciamento de janelas", "## This controls when the dialogue window is displayed. If \"show\", it is always displayed. If \"hide\", it is only displayed when dialogue is present. If \"auto\", the window is hidden before scene statements and shown again once dialogue is displayed.": "## Isso controla quando a janela de diálogo é exibida. Se for \"show\", ela será sempre exibida. Se for \"hide\" (ocultar), ela só será exibida quando o diálogo estiver presente. Se for \"auto\", a janela será ocultada antes das declarações de cena e mostrada novamente quando o diálogo for exibido.", "## After the game has started, this can be changed with the \"window show\", \"window hide\", and \"window auto\" statements.": "## Após o início do jogo, isso pode ser alterado com as instruções \"window show\", \"window hide\" e \"window auto\".", "## Transitions used to show and hide the dialogue window": "## Transições usadas para mostrar e ocultar a janela de diálogo", "## Preference defaults": "## Padrões de preferência", "## Controls the default text speed. The default, 0, is infinite, while any other number is the number of characters per second to type out.": "## Controla a velocidade padrão do texto. O padrão, 0, é infinito, enquanto qualquer outro número é o número de caracteres por segundo a serem digitados.", "## The default auto-forward delay. Larger numbers lead to longer waits, with 0 to 30 being the valid range.": "## O atraso padrão do encaminhamento automático. Números maiores levam a esperas mais longas, sendo 0 a 30 o intervalo válido.", "## Save directory": "## Salvar diretório", "## Controls the platform-specific place Ren'Py will place the save files for this game. The save files will be placed in:": "## Controla o local específico da plataforma onde o Ren'Py colocará os arquivos salvos para este jogo. Os arquivos de salvamento serão colocados em:", "## This generally should not be changed, and if it is, should always be a literal string, not an expression.": "## Isso geralmente não deve ser alterado e, se for, deve ser sempre uma string literal, não uma expressão.", "## Icon": "## Ícone", "## The icon displayed on the taskbar or dock.": "## O ícone exibido na barra de tarefas ou no dock.", "## Build configuration": "## Configuração de compilação", "## This section controls how Ren'Py turns your project into distribution files.": "## Esta seção controla como o Ren'Py transforma o seu projeto em arquivos de distribuição.", "## The following functions take file patterns. File patterns are case- insensitive, and matched against the path relative to the base directory, with and without a leading /. If multiple patterns match, the first is used.": "## As funções a seguir aceitam padrões de arquivos. Os padrões de arquivos não diferenciam maiúsculas de minúsculas e são comparados com o caminho relativo ao diretório base, com e sem um /. Se vários padrões corresponderem, o primeiro será usado.", "## In a pattern:": "## Em um padrão:", "## / is the directory separator.": "## / é o separador de diretórios.", "## * matches all characters, except the directory separator.": "## * corresponde a todos os caracteres, exceto o separador de diretório.", "## ** matches all characters, including the directory separator.": "## ** corresponde a todos os caracteres, inclusive o separador de diretório.", "## For example, \"*.txt\" matches txt files in the base directory, \"game/**.ogg\" matches ogg files in the game directory or any of its subdirectories, and \"**.psd\" matches psd files anywhere in the project.": "## Por exemplo, \"*.txt\" corresponde a arquivos txt no diretório base, \"game/**.ogg\" corresponde a arquivos ogg no diretório do jogo ou em qualquer um de seus subdiretórios e \"**.psd\" corresponde a arquivos psd em qualquer lugar do projeto.", "## Classify files as None to exclude them from the built distributions.": "## Classifique os arquivos como None (Nenhum) para excluí-los das distribuições criadas.", "## To archive files, classify them as 'archive'.": "## Para arquivar arquivos, classifique-os como \"arquivo\".", "## Files matching documentation patterns are duplicated in a mac app build, so they appear in both the app and the zip file.": "## Os arquivos que correspondem aos padrões de documentação são duplicados em uma compilação de aplicativo para Mac, de modo que aparecem tanto no aplicativo quanto no arquivo zip.", "## A Google Play license key is required to perform in-app purchases. It can be found in the Google Play developer console, under \"Monetize\" > \"Monetization Setup\" > \"Licensing\".": "## É necessária uma chave de licença do Google Play para realizar compras no aplicativo. Ela pode ser encontrada no console do desenvolvedor do Google Play, em \"Monetizar\" > \"Configuração de monetização\" > \"Licenciamento\".", "## The username and project name associated with an itch.io project, separated by a slash.": "## O nome de usuário e o nome do projeto associados a um projeto itch.io, separados por uma barra.", "Launcher Preferences": "Preferências do Launcher", "Projects Directory:": "Diretório dos projetos:", "Not Set": "Não estabelecido", "Text Editor:": "Editor de texto:", "Update Channel:": "Canal de atualização", "Navigation Options:": "Opções de navegação:", "Include private names": "Incluir nomes privados", "Include library names": "Incluir nomes das bibliotecas", "Launcher Options:": "Opções do Launcher:", "Hardware rendering": "Renderização por hardware", "Show templates": "Mostrar templates", "Console output": "Saida do console", "Open launcher project": "Abrir projeto do launcher", "Language:": "Idioma:", "Projects directory: [text]": "Diretório dos projetos: [text]", "Text editor: [text]": "Editor de texto: [text]", "Large fonts": "Fontes grandes", "Show edit file section": "Mostrar a seção Editar Arquivo", "Generate empty strings for translations": "Gerar strings vazias para as traduções", "Launching the project failed.": "A execução do projeto falhou.", "Please ensure that your project launches normally before running this command.": "Por favor, garanta que seu projeto executa normalmente antes de tentar este comando.", "Ren'Py is scanning the project...": "Ren'Py está escaneando o projeto...", "PROJECTS DIRECTORY": "DIRETÓRIO DOS PROJETOS", "Please choose the projects directory using the directory chooser.\n{b}The directory chooser may have opened behind this window.{/b}": "Por favor escolha o diretório dos projetos usando o selecionador de diretorios \n{b}O selecionador de diretórios talvez possa estar aberto atrás dessa janela.", "This launcher will scan for projects in this directory, will create new projects in this directory, and will place built projects into this directory.": "O launcher buscará por projetos nesse diretório, criará novos projetos nesse diretório, e colocará os projetos nesse diretório.", "Ren'Py was unable to run python with tkinter to choose the projects directory.": "Ren'Py foi impedido de executar python com tkinter para escolher o diretório de projetos .", "Ren'Py has set the projects directory to:": "Ren'Py configurou o diretório de projetos para:", "After making changes to the script, press shift+R to reload your game.": "Depois de realizar mudanças em um script, pressione shift+R para recarregar seu jogo.", "Press shift+O (the letter) to access the console.": "Pressione shift+O (a letra) para acessar o console.", "Press shift+D to access the developer menu.": "Pressione shift+D para acessar o menu de desenvolvedor.", "Launching": "Executando", "Ren'Py was unable to run python with tkinter to choose the projects directory. Please install the python-tk or tkinter package.": "Ren'Py não pode executar python com tkinter para escolher o diretório de projetos. Por favor, instale o pacote python-tk ou tkinter.", "Have you backed up your projects recently?": "Realizou backup dos seus projetos recentemente?", "## Styles": "## Estilos", "## In-game screens": "## Telas no jogo", "## Say screen": "## Diga a tela", "## The say screen is used to display dialogue to the player. It takes two parameters, who and what, which are the name of the speaking character and the text to be displayed, respectively. (The who parameter can be None if no name is given.)": "## A tela say é usada para exibir o diálogo para o jogador. Ela recebe dois parâmetros, who e what, que são o nome do personagem que fala e o texto a ser exibido, respectivamente. (O parâmetro who pode ser None (Nenhum) se nenhum nome for fornecido).", "## This screen must create a text displayable with id \"what\", as Ren'Py uses this to manage text display. It can also create displayables with id \"who\" and id \"window\" to apply style properties.": "## Essa tela deve criar um texto exibível com o id \"what\", pois o Ren'Py o utiliza para gerenciar a exibição de texto. Ela também pode criar exibíveis com id \"who\" e id \"window\" para aplicar propriedades de estilo.", "## If there's a side image, display it above the text. Do not display on the phone variant - there's no room.": "## Se houver uma imagem lateral, exiba-a acima do texto. Não exiba na variante do telefone - não há espaço.", "## Make the namebox available for styling through the Character object.": "## Disponibilize a caixa de nome para estilização por meio do objeto Character.", "## Input screen": "## Tela de entrada", "## This screen is used to display renpy.input. The prompt parameter is used to pass a text prompt in.": "## Essa tela é usada para exibir renpy.input. O parâmetro prompt é usado para passar um prompt de texto.", "## This screen must create an input displayable with id \"input\" to accept the various input parameters.": "## Essa tela deve criar um displayable de entrada com id \"input\" para aceitar os vários parâmetros de entrada.", "## Choice screen": "## Tela de escolha", "## This screen is used to display the in-game choices presented by the menu statement. The one parameter, items, is a list of objects, each with caption and action fields.": "## Essa tela é usada para exibir as opções no jogo apresentadas pela instrução de menu. O único parâmetro, itens, é uma lista de objetos, cada um com campos de legenda e ação.", "## Quick Menu screen": "## Tela do menu rápido", "## The quick menu is displayed in-game to provide easy access to the out-of-game menus.": "## O menu rápido é exibido no jogo para fornecer acesso fácil aos menus fora do jogo.", "## Ensure this appears on top of other screens.": "## Certifique-se de que isso apareça na parte superior de outras telas.", "History": "Histórico", "Skip": "Pular", "Auto": "Automotivo", "Save": "Salvar", "Q.Save": "Q.Salvar", "Q.Load": "Q. Carga", "## This code ensures that the quick_menu screen is displayed in-game, whenever the player has not explicitly hidden the interface.": "## Esse código garante que a tela quick_menu seja exibida no jogo, sempre que o jogador não tiver ocultado explicitamente a interface.", "## Main and Game Menu Screens": "## Telas do menu principal e do menu do jogo", "## Navigation screen": "## Tela de navegação", "## This screen is included in the main and game menus, and provides navigation to other menus, and to start the game.": "## Essa tela está incluída nos menus principal e do jogo e fornece navegação para outros menus e para iniciar o jogo.", "Start": "Início", "Load": "Carga", "Preferences": "Preferências", "End Replay": "Fim da reprodução", "Main Menu": "Menu principal", "## Help isn't necessary or relevant to mobile devices.": "## A ajuda não é necessária ou relevante para dispositivos móveis.", "Help": "Ajuda", "## The quit button is banned on iOS and unnecessary on Android and Web.": "## O botão Sair é proibido no iOS e desnecessário no Android e na Web.", "## Main Menu screen": "## Tela do menu principal", "## Used to display the main menu when Ren'Py starts.": "## Usado para exibir o menu principal quando o Ren'Py é iniciado.", "## This ensures that any other menu screen is replaced.": "## Isso garante que qualquer outra tela de menu seja substituída.", "## This empty frame darkens the main menu.": "## Esse quadro vazio escurece o menu principal.", "## The use statement includes another screen inside this one. The actual contents of the main menu are in the navigation screen.": "## A instrução de uso inclui outra tela dentro desta. O conteúdo real do menu principal está na tela de navegação.", "## Game Menu screen": "## Tela do menu do jogo", "## This lays out the basic common structure of a game menu screen. It's called with the screen title, and displays the background, title, and navigation.": "## Isso estabelece a estrutura básica comum de uma tela de menu de jogo. Ela é chamada com o título da tela e exibe o plano de fundo, o título e a navegação.", "## Reserve space for the navigation section.": "## Reserve espaço para a seção de navegação.", "## About screen": "## Sobre a tela", "## This screen gives credit and copyright information about the game and Ren'Py.": "## Essa tela fornece informações de crédito e direitos autorais sobre o jogo e Ren'Py.", "## There's nothing special about this screen, and hence it also serves as an example of how to make a custom screen.": "## Não há nada de especial nessa tela e, portanto, ela também serve como exemplo de como criar uma tela personalizada.", "## This use statement includes the game_menu screen inside this one. The vbox child is then included inside the viewport inside the game_menu screen.": "## Essa instrução de uso inclui a tela game_menu dentro desta. O filho vbox é então incluído na janela de visualização dentro da tela game_menu.", "Version [config.version!t]\n": "Versão [config.version!t]\n", "## gui.about is usually set in options.rpy.": "## gui.about é normalmente definido em options.rpy.", "Made with {a=https://www.renpy.org/}Ren'Py{/a} [renpy.version_only].\n\n[renpy.license!t]": "Feito com {a=https://www.renpy.org/}Ren'Py{/a} [renpy.version_only] .\n\n[renpy.license!t]", "## Load and Save screens": "## Carregar e salvar telas", "## These screens are responsible for letting the player save the game and load it again. Since they share nearly everything in common, both are implemented in terms of a third screen, file_slots.": "## Essas telas são responsáveis por permitir que o jogador salve o jogo e o carregue novamente. Como elas têm quase tudo em comum, ambas são implementadas em termos de uma terceira tela, file_slots.", "Page {}": "Página {}", "Automatic saves": "Salvamentos automáticos", "Quick saves": "Salvamentos rápidos", "## This ensures the input will get the enter event before any of the buttons do.": "## Isso garante que a entrada receberá o evento enter antes de qualquer um dos botões.", "## The page name, which can be edited by clicking on a button.": "## O nome da página, que pode ser editado clicando em um botão.", "## The grid of file slots.": "## A grade de slots de arquivo.", "empty slot": "slot vazio", "## Buttons to access other pages.": "## Botões para acessar outras páginas.", "## range(1, 10) gives the numbers from 1 to 9.": "## range(1, 10) fornece os números de 1 a 9.", "Download Sync": "Baixar o Sync", "## Preferences screen": "## Tela de preferências", "## The preferences screen allows the player to configure the game to better suit themselves.": "## A tela de preferências permite que o jogador configure o jogo para se adequar melhor.", "Unseen Text": "Texto invisível", "After Choices": "Após as escolhas", "Transitions": "Transições", "## Additional vboxes of type \"radio_pref\" or \"check_pref\" can be added here, to add additional creator-defined preferences.": "## Vboxes adicionais do tipo \"radio_pref\" ou \"check_pref\" podem ser adicionadas aqui para acrescentar outras preferências definidas pelo criador.", "Text Speed": "Velocidade do texto", "Auto-Forward Time": "Tempo de encaminhamento automático", "Music Volume": "Volume da música", "Test": "Teste", "Voice Volume": "Volume da voz", "Mute All": "Silenciar tudo", "## History screen": "## Tela de histórico", "## This is a screen that displays the dialogue history to the player. While there isn't anything special about this screen, it does have to access the dialogue history stored in _history_list.": "## Essa é uma tela que exibe o histórico de diálogo para o jogador. Embora não haja nada de especial nessa tela, ela precisa acessar o histórico de diálogo armazenado em _history_list.", "## Avoid predicting this screen, as it can be very large.": "## Evite prever essa tela, pois ela pode ser muito grande.", "## This lays things out properly if history_height is None.": "## Isso organiza as coisas corretamente se history_height for None.", "## Take the color of the who text from the Character, if set.": "## Pegue a cor do texto who do caractere, se definido.", "The dialogue history is empty.": "O histórico de diálogo está vazio.", "## This determines what tags are allowed to be displayed on the history screen.": "## Isso determina quais tags podem ser exibidas na tela de histórico.", "## Help screen": "## Tela de ajuda", "## A screen that gives information about key and mouse bindings. It uses other screens (keyboard_help, mouse_help, and gamepad_help) to display the actual help.": "## Uma tela que fornece informações sobre as combinações de teclas e mouse. Ela usa outras telas (keyboard_help, mouse_help e gamepad_help) para exibir a ajuda real.", "Keyboard": "Teclado", "Gamepad": "Controle de jogo", "Enter": "Entrar", "Advances dialogue and activates the interface.": "Avança o diálogo e ativa a interface.", "Space": "Espaço", "Advances dialogue without selecting choices.": "Avança o diálogo sem selecionar opções.", "Arrow Keys": "Teclas de seta", "Navigate the interface.": "Navegue pela interface.", "Escape": "Fuga", "Accesses the game menu.": "Acessa o menu do jogo.", "Skips dialogue while held down.": "Pula o diálogo quando pressionado.", "Toggles dialogue skipping.": "Alterna o salto de diálogo.", "Page Up": "Página para cima", "Rolls back to earlier dialogue.": "Volta ao diálogo anterior.", "Page Down": "Página para baixo", "Rolls forward to later dialogue.": "Rola para frente o diálogo posterior.", "Hides the user interface.": "Oculta a interface do usuário.", "Takes a screenshot.": "Faz uma captura de tela.", "Toggles assistive {a=https://www.renpy.org/l/voicing}self-voicing{/a}.": "Alterna a assistência {a=https://www.renpy.org/l/voicing}auto-voz{/a}.", "Opens the accessibility menu.": "Abre o menu de acessibilidade.", "Left Click": "Clique com o botão esquerdo do mouse", "Middle Click": "Clique no meio", "Right Click": "Clique com o botão direito do mouse", "Mouse Wheel Up\nClick Rollback Side": "Roda do mouse para cima\nClique em Rollback Side", "Mouse Wheel Down": "Roda do mouse para baixo", "Right Trigger\nA/Bottom Button": "Gatilho direito\nBotão A/inferior", "Left Trigger\nLeft Shoulder": "Gatilho esquerdo\nOmbro esquerdo", "Right Shoulder": "Ombro direito", "D-Pad, Sticks": "D-Pad, bastões", "Start, Guide": "Início, Guia", "Y/Top Button": "Botão Y/Top", "Calibrate": "Calibrar", "## Additional screens": "## Telas adicionais", "## Confirm screen": "## Confirmar tela", "## The confirm screen is called when Ren'Py wants to ask the player a yes or no question.": "## A tela de confirmação é chamada quando Ren'Py quer fazer uma pergunta de sim ou não ao jogador.", "## Ensure other screens do not get input while this screen is displayed.": "## Certifique-se de que outras telas não recebam entrada enquanto essa tela estiver sendo exibida.", "## Right-click and escape answer \"no\".": "## Clique com o botão direito do mouse e escape a resposta \"não\".", "## Skip indicator screen": "## Pular a tela do indicador", "## The skip_indicator screen is displayed to indicate that skipping is in progress.": "## A tela skip_indicator é exibida para indicar que o salto está em andamento.", "Skipping": "Pular", "## This transform is used to blink the arrows one after another.": "## Essa transformação é usada para piscar as setas uma após a outra.", "## We have to use a font that has the BLACK RIGHT-POINTING SMALL TRIANGLE glyph in it.": "## Temos que usar uma fonte que tenha o glifo BLACK RIGHT-POINTING SMALL TRIANGLE.", "## Notify screen": "## Tela de notificação", "## The notify screen is used to show the player a message. (For example, when the game is quicksaved or a screenshot has been taken.)": "## A tela de notificação é usada para mostrar uma mensagem ao jogador. (Por exemplo, quando o jogo é salvo rapidamente ou quando uma captura de tela é feita).", "## NVL screen": "## Tela NVL", "## This screen is used for NVL-mode dialogue and menus.": "## Essa tela é usada para o diálogo e os menus do modo NVL.", "## Displays dialogue in either a vpgrid or the vbox.": "## Exibe o diálogo em uma vpgrid ou na vbox.", "## Displays the menu, if given. The menu may be displayed incorrectly if config.narrator_menu is set to True.": "## Exibe o menu, se fornecido. O menu poderá ser exibido incorretamente se config.narrator_menu estiver definido como True.", "## This controls the maximum number of NVL-mode entries that can be displayed at once.": "## Isso controla o número máximo de entradas do modo NVL que podem ser exibidas de uma vez.", "## Bubble screen": "## Tela de bolhas", "## The bubble screen is used to display dialogue to the player when using speech bubbles. The bubble screen takes the same parameters as the say screen, must create a displayable with the id of \"what\", and can create displayables with the \"namebox\", \"who\", and \"window\" ids.": "## A tela de balão é usada para exibir o diálogo para o jogador ao usar balões de fala. A tela de bolhas recebe os mesmos parâmetros que a tela de dizer, deve criar um exibível com o ID de \"what\" e pode criar exibíveis com os IDs \"namebox\", \"who\" e \"window\".", "## Mobile Variants": "## Variantes do celular", "## Since a mouse may not be present, we replace the quick menu with a version that uses fewer and bigger buttons that are easier to touch.": "## Como o mouse pode não estar presente, substituímos o menu rápido por uma versão que usa menos botões e maiores, que são mais fáceis de tocar.", "## The scroll parameter can be None, or one of \"viewport\" or \"vpgrid\". This screen is intended to be used with one or more children, which are transcluded (placed) inside it.": "## O parâmetro de rolagem pode ser Nenhum ou um dos parâmetros \"viewport\" ou \"vpgrid\". Essa tela deve ser usada com um ou mais filhos, que são transcluídos (colocados) dentro dela.", "Create or Update Translations": "Criar ou Atualizar Traduções", "Please enter the name of the language for which you want to create or update translations.": "Por favor introduza o nome da linguagem que deseja criar ou atualizar uma tradução.", "The language name can not be the empty string.": "O nome do idioma não pode estar vazio.", "Ren'Py is generating translations....": "Ren'Py está gerando as atualizações...", "Ren'Py has finished generating [language] translations.": "Ren'Py terminou de gerar as traduções para [language]", "What format would you like for the extracted dialogue?": "Que formato você deseja para o dialogo extraido?", "Ren'Py is extracting dialogue....": "Ren'Py está extraindo os dialógos...", "Ren'Py has finished extracting dialogue. The extracted dialogue can be found in dialogue.[format] in the base directory.": "Ren'Py terminou de extrair os diálogos. Os diálogos extraídos podem se encontrar no formato .[format] no diretório base.", "Select Update Channel": "Selecione o Canal de Atualização", "The update channel controls the version of Ren'Py the updater will download. Please select an update channel:": "O canal de atualização controla a versao do Ren'Py que o atualizador baixará. Por favor selecione um canal de atualização", "Release": "Liberação", "{b}Recommended.{/b} The version of Ren'Py that should be used in all newly-released games.": "{b}Recomendado.{/b} A versão do Ren'Py que é recomendada para uso em todos os jogos recém lançados.", "Prerelease": "Pré-lançamento", "A preview of the next version of Ren'Py that can be used for testing and taking advantage of new features, but not for final releases of games.": "Uma prévia da próxima versão do Ren'Py que pode ser usada para testar e tirar proveito de novos recursos, mas não para lançamentos finais de jogos.", "Experimental versions of Ren'Py. You shouldn't select this channel unless asked by a Ren'Py developer.": "Versões experimentais do Ren'Py. Não deves selecionar este canal a menos que seja pedido por um desenvolvedor do Ren'Py.", "Nightly": "Todas as noites", "The bleeding edge of Ren'Py development. This may have the latest features, or might not run at all.": "Última versão, ainda instavél, do Ren'Py. Pode ter as últimas características ou pode não funcionar de vez.", "An error has occured:": "Um erro ocorreu:", "Checking for updates.": "Checando por atualizações.", "Ren'Py is up to date.": "Ren'Py está atualizado.", "[u.version] is now available. Do you want to install it?": "[u.version] está disponivel. Você deseja instala-la?", "Preparing to download the update.": "Preparando para baixar a atualização.", "Downloading the update.": "Baixando a atualização.", "Unpacking the update.": "Extraindo a atualização.", "Finishing up.": "Finalizar.", "The update has been installed. Ren'Py will restart.": "A atualização foi instalada. Ren'Py irá reiniciar.", "The update has been installed.": "A atualizaçao foi instalada.", "The update was cancelled.": "A atualização foi cancelada.", "Ren'Py Update": "Atualizar Ren'Py", "Proceed": "Seguir"}